[
  { "code": "B20", "dx": "Human immunodeficiency virus disease", "hccWeight": 0.301, "isHCC": true, "criticalFacts": ["Continue antiretroviral therapy and monitor viral load and CD4 lymphocyte count to confirm durable suppression and immune recovery.", "Review medication interactions and kidney and liver function before changing therapy because drug interactions are a common driver of preventable harm.", "Provide immunizations and opportunistic infection prevention based on immune status and prior infection history."], "advancesSharedSavings": true, "category": "Infectious Disease", "goodToKnow1": "Document current treatment and recent viral load results to support clinical accuracy and risk stratification.", "goodToKnow2": "Uncontrolled infection and medication interactions are common causes of avoidable emergency department visits and admissions.", "goodToKnow3": "Confirm the diagnosis is active and addressed during the encounter when used for risk adjustment." },

  { "code": "A41.50", "dx": "Sepsis due to gram negative organism, unspecified", "hccWeight": 0.5, "isHCC": true, "criticalFacts": ["Sepsis requires urgent assessment for infection source, organ dysfunction, and hemodynamic instability because delays worsen outcomes.", "Prompt antimicrobial therapy and source control are central when clinically indicated, followed by reassessment as cultures and imaging clarify the diagnosis.", "After stabilization, narrow antimicrobial therapy when appropriate to reduce complications and support antimicrobial stewardship."], "advancesSharedSavings": true, "category": "Infectious Disease", "goodToKnow1": "Clearly document suspected source and organ dysfunction markers to support severity and treatment decisions.", "goodToKnow2": "Early recognition and appropriate de escalation reduce length of stay and readmissions.", "goodToKnow3": "Track follow up after discharge to prevent relapse and medication adverse events." },

  { "code": "A41.51", "dx": "Sepsis due to Escherichia coli", "hccWeight": 0.5, "isHCC": true, "criticalFacts": ["Document the likely source such as urinary, biliary, or intra abdominal infection because source drives antibiotic choice and follow up testing.", "Ensure timely antimicrobial therapy and evaluate for complications such as acute kidney injury or shock.", "Transition to the narrowest effective therapy based on cultures and clinical response to reduce collateral damage and resistance."], "advancesSharedSavings": true, "category": "Infectious Disease", "goodToKnow1": "Review culture data and planned duration of therapy in the assessment and plan.", "goodToKnow2": "Medication reconciliation and close follow up reduce post discharge adverse events and readmissions.", "goodToKnow3": "Sepsis often indicates high risk for future utilization and may warrant care management outreach." },

  { "code": "A41.9", "dx": "Sepsis, unspecified organism", "hccWeight": 0.5, "isHCC": true, "criticalFacts": ["An unspecified organism should trigger documentation improvement to identify suspected source and organism when supported by testing.", "Assess for organ dysfunction and treat urgently because sepsis is a time sensitive condition.", "Reassess daily for opportunity to narrow therapy and to stop unnecessary antibiotics when sepsis is not confirmed."], "advancesSharedSavings": true, "category": "Infectious Disease", "goodToKnow1": "If cultures are negative, document the clinical rationale for continuing or stopping therapy.", "goodToKnow2": "Avoidable costs often come from prolonged broad therapy and missed follow up after discharge.", "goodToKnow3": "Use the most specific diagnosis supported by the record as soon as available." },

  { "code": "B59", "dx": "Pneumocystosis", "hccWeight": 0.381, "isHCC": true, "criticalFacts": ["Pneumocystis infection strongly suggests immune compromise and should prompt evaluation for underlying cause and immune status.", "Treatment courses are prolonged and require monitoring for medication toxicity and oxygenation response.", "Prevention is often indicated after recovery in patients with persistent immune suppression."], "advancesSharedSavings": true, "category": "Infectious Disease", "goodToKnow1": "Document immune suppression drivers such as human immunodeficiency virus, transplant status, or immunosuppressive therapy.", "goodToKnow2": "Early outpatient follow up reduces relapse and re hospitalization.", "goodToKnow3": "Coordinate specialty care and preventive services to reduce complications." },

  { "code": "C79.9", "dx": "Secondary malignant neoplasm of unspecified site", "hccWeight": 2.341, "isHCC": true, "criticalFacts": ["Metastatic cancer status should be clearly documented as active disease versus history because this changes treatment planning and risk stratification.", "Assess for common high cost complications such as pain crisis, pathologic fracture risk, hypercalcemia, and treatment toxicity.", "Early palliative care and symptom management planning reduce avoidable emergency department visits and admissions."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Specify primary cancer site and known metastatic sites when available for clinical clarity.", "goodToKnow2": "High utilization frequently comes from uncontrolled symptoms and treatment complications.", "goodToKnow3": "Document active treatment and current staging workup when available." },

  { "code": "C79.51", "dx": "Secondary malignant neoplasm of bone", "hccWeight": 2.341, "isHCC": true, "criticalFacts": ["Bone metastases increase fracture risk and pain burden and often require coordinated oncology, radiation oncology, and supportive care.", "Evaluate for spinal cord compression symptoms and urgent neurologic deficits because delays can cause permanent disability.", "Monitor for hypercalcemia and treatment related renal injury when using bone targeted therapies."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Document imaging evidence and symptom burden such as functional limits and pain control plan.", "goodToKnow2": "Preventing falls and fractures is a major shared savings lever in metastatic bone disease.", "goodToKnow3": "Ensure appropriate referrals and clear follow up to avoid emergency presentations." },

  { "code": "C79.31", "dx": "Secondary malignant neoplasm of brain", "hccWeight": 2.341, "isHCC": true, "criticalFacts": ["Brain metastases increase risk of seizures, edema, and neurologic decline and require prompt treatment planning.", "Medication management often includes seizure prevention or treatment and edema control, with close monitoring for adverse effects.", "Care planning should address safety risks such as driving, falls, and supervision needs."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Document neurologic findings and current treatment plan such as radiation therapy or systemic therapy.", "goodToKnow2": "Unplanned admissions often result from seizure or acute neurologic decline.", "goodToKnow3": "Coordinate palliative care when symptom burden is high." },

  { "code": "C34.30", "dx": "Malignant neoplasm of lower lobe, unspecified bronchus or lung", "hccWeight": 1.136, "isHCC": true, "criticalFacts": ["Confirm histology and staging because treatment pathways and prognosis depend on stage and molecular findings.", "Assess and reduce preventable complications such as venous thromboembolism, malnutrition, and infection during treatment.", "Smoking cessation support improves outcomes and reduces exacerbations of comorbid lung disease."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Document whether disease is active and whether the patient is receiving active treatment.", "goodToKnow2": "Avoidable utilization often comes from dehydration, infection, and uncontrolled symptoms during therapy.", "goodToKnow3": "Coordinate pulmonary and cardiology comorbidity management to reduce admissions." },

  { "code": "C34.90", "dx": "Malignant neoplasm of unspecified part of unspecified bronchus or lung", "hccWeight": 1.136, "isHCC": true, "criticalFacts": ["Use the most specific site when known because laterality and lobe can affect treatment decisions and tracking.", "Monitor for treatment toxicity, respiratory compromise, and infection, especially in patients with underlying chronic lung disease.", "Support vaccination and symptom control to reduce preventable exacerbations and emergency visits."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Clarify active cancer versus history of cancer to avoid misclassification.", "goodToKnow2": "Coordination of care transitions is a major shared savings opportunity in oncology patients.", "goodToKnow3": "Document performance status and functional limits when relevant." },

  { "code": "C18.9", "dx": "Malignant neoplasm of colon, unspecified", "hccWeight": 0.363, "isHCC": true, "criticalFacts": ["Staging determines therapy and surveillance and should be documented when known.", "Assess for anemia, bowel obstruction, and weight loss because these drive urgent utilization.", "Coordinate surgical, oncology, and nutrition care to reduce complications and unplanned admissions."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Document whether the malignancy is active and being treated in the current year.", "goodToKnow2": "Hospitalizations often relate to obstruction, infection, and treatment toxicity.", "goodToKnow3": "If the condition is historical only, use an appropriate history code instead of active malignancy." },

  { "code": "C67.9", "dx": "Malignant neoplasm of bladder, unspecified", "hccWeight": 0.363, "isHCC": true, "criticalFacts": ["Bladder cancer can cause hematuria, urinary obstruction, and recurrent infections, which are key drivers of acute care use.", "Treatment planning depends on stage and grade, including intravesical therapy versus systemic therapy.", "Monitor kidney function and urinary tract complications during therapy."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Document hematuria, anemia, and urinary symptoms because they affect management intensity.", "goodToKnow2": "Avoidable admissions often result from infection or obstruction.", "goodToKnow3": "Coordinate urology and oncology follow up and ensure clear return precautions." },

  { "code": "C64.9", "dx": "Malignant neoplasm of unspecified kidney, except renal pelvis", "hccWeight": 0.363, "isHCC": true, "criticalFacts": ["Document stage and whether treatment is active because management differs for localized versus metastatic disease.", "Monitor kidney function closely after nephrectomy or during systemic therapy.", "Assess cardiovascular risk and blood pressure control because chronic kidney disease progression increases future cost and utilization."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Clarify laterality and histology when available to improve specificity.", "goodToKnow2": "Avoidable utilization often relates to acute kidney injury, infection, and uncontrolled pain.", "goodToKnow3": "Coordination with nephrology is often high value when kidney function declines." },

  { "code": "C50.919", "dx": "Malignant neoplasm of unspecified site of unspecified female breast", "hccWeight": 0.186, "isHCC": true, "criticalFacts": ["Document tumor receptor status and stage when known because treatment selection and surveillance depend on these details.", "Monitor for cardiotoxicity with select therapies and coordinate cardiology comorbidity management.", "Support adherence and symptom control to reduce emergency department utilization during treatment."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Specify laterality and site within the breast when available to improve diagnosis specificity.", "goodToKnow2": "Avoidable utilization often relates to infection, dehydration, and unmanaged adverse effects.", "goodToKnow3": "Document whether the malignancy is active versus a history of malignancy." },

  { "code": "C61", "dx": "Malignant neoplasm of prostate", "hccWeight": 0.186, "isHCC": true, "criticalFacts": ["Management depends on stage and risk group, ranging from active surveillance to systemic therapy.", "Assess for urinary obstruction symptoms, bone pain, and treatment adverse effects.", "Coordinate primary care risk reduction because cardiovascular risk commonly increases during androgen deprivation therapy."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Clarify whether disease is active and being treated versus history only.", "goodToKnow2": "Avoidable utilization often relates to urinary retention, infection, and uncontrolled pain.", "goodToKnow3": "Document shared decision making and follow up plan." },

  { "code": "C81.90", "dx": "Hodgkin lymphoma, unspecified, unspecified site", "hccWeight": 0.671, "isHCC": true, "criticalFacts": ["Document whether disease is active, in remission, or relapsed because this affects surveillance and treatment intensity.", "Monitor for infection and cytopenias during therapy, which are common drivers of hospitalization.", "Vaccination planning and infection prevention are key due to immune suppression."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Include treatment status and recent imaging summary when available.", "goodToKnow2": "Avoidable admissions often relate to febrile illness and treatment adverse effects.", "goodToKnow3": "Coordinate hematology and primary care follow up." },

  { "code": "C85.90", "dx": "Non Hodgkin lymphoma, unspecified, unspecified site", "hccWeight": 0.671, "isHCC": true, "criticalFacts": ["Classification and stage drive treatment, so specify subtype when known.", "Immune suppression increases infection risk and may require prophylaxis and vaccination planning.", "Treatment toxicity monitoring, including cardiac and kidney function when applicable, reduces avoidable harm."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Document active disease status and current therapy to support risk stratification.", "goodToKnow2": "Care coordination and early symptom management reduce emergency utilization.", "goodToKnow3": "Avoid unspecified wording when pathology is available." },

  { "code": "C90.01", "dx": "Multiple myeloma in remission", "hccWeight": 1.136, "isHCC": true, "criticalFacts": ["Even in remission, myeloma history often implies ongoing monitoring for relapse, infection risk, and bone disease complications.", "Assess for anemia, kidney dysfunction, and bone pain because these often drive acute care utilization.", "Medication reconciliation is essential because therapy and supportive medicines can be complex and high risk."], "advancesSharedSavings": true, "category": "Hematology and Oncology", "goodToKnow1": "Document remission status and surveillance plan.", "goodToKnow2": "Avoidable admissions commonly result from infection, dehydration, and pathologic fracture.", "goodToKnow3": "Coordinate bone health and fall prevention." },

  { "code": "D46.4", "dx": "Refractory anemia, unspecified", "hccWeight": 1.798, "isHCC": true, "criticalFacts": ["Refractory anemia is typically a bone marrow disorder and warrants hematology evaluation and ongoing monitoring.", "Assess transfusion needs, iron overload risk, and infection risk when immune suppression is present.", "Document symptoms such as dyspnea, fatigue, and functional impact because they guide treatment intensity."], "advancesSharedSavings": true, "category": "Hematology", "goodToKnow1": "Clarify whether anemia is due to myelodysplastic syndrome when known.", "goodToKnow2": "Avoidable utilization often comes from symptomatic anemia and transfusion related complications.", "goodToKnow3": "Medication review and vaccination planning help reduce infection related admissions." },

  { "code": "Z51.11", "dx": "Encounter for antineoplastic chemotherapy", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["This encounter code does not replace documentation of the underlying active malignancy diagnosis.", "Chemotherapy increases risk of infection, dehydration, nausea, and medication interactions, which can drive preventable admissions.", "Close follow up and symptom management planning reduce emergency department visits during treatment cycles."], "advancesSharedSavings": true, "category": "Oncology", "goodToKnow1": "Pair this encounter code with the correct active malignancy code when the cancer is active.", "goodToKnow2": "Document treatment complications when present because they change risk and management needs.", "goodToKnow3": "Medication reconciliation and hydration planning are high value." },

  { "code": "E11.9", "dx": "Type 2 diabetes mellitus without complications", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Monitor hemoglobin A one c and home glucose patterns to guide therapy adjustments and prevent hypoglycemia.", "Annual kidney and eye complication screening reduces progression and prevents avoidable utilization.", "Cardiovascular risk reduction through blood pressure control, lipid management, and smoking cessation reduces long term cost."], "advancesSharedSavings": true, "category": "Endocrinology and Metabolism", "goodToKnow1": "Document current hemoglobin A one c and treatment plan to support accurate risk stratification.", "goodToKnow2": "Medication adherence and nutrition counseling are major drivers of shared savings in diabetes.", "goodToKnow3": "Specify complications when present because management and monitoring intensity changes." },

  { "code": "E11.10", "dx": "Type 2 diabetes mellitus with ketoacidosis without coma", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Diabetic ketoacidosis is an acute life threatening complication requiring urgent evaluation, treatment, and follow up planning.", "Identify triggers such as infection, missed insulin, medication effects, or dehydration to prevent recurrence.", "After stabilization, reassess the diabetes regimen and education to reduce readmissions."], "advancesSharedSavings": true, "category": "Endocrinology and Metabolism", "goodToKnow1": "Document precipitating factors and discharge education plan when applicable.", "goodToKnow2": "High recurrence risk makes follow up within a short interval a shared savings lever.", "goodToKnow3": "Ensure access barriers to insulin and supplies are addressed." },

  { "code": "E11.11", "dx": "Type 2 diabetes mellitus with ketoacidosis with coma", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Diabetic ketoacidosis with coma indicates severe metabolic decompensation with high risk of complications and mortality.", "Document organ dysfunction and neurologic recovery status for care planning.", "Preventing recurrence requires addressing adherence, access to medications, and trigger management."], "advancesSharedSavings": true, "category": "Endocrinology and Metabolism", "goodToKnow1": "Document neurologic status and recovery plan, including safety needs after discharge.", "goodToKnow2": "Care coordination reduces readmissions and emergency visits in high risk diabetes.", "goodToKnow3": "Review medication list for agents that increase ketoacidosis risk in susceptible patients." },

  { "code": "E10.10", "dx": "Type 1 diabetes mellitus with ketoacidosis without coma", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Diabetic ketoacidosis in type one diabetes requires urgent treatment and careful education to prevent recurrence.", "Assess insulin access, dosing errors, and illness management plan because these are common preventable causes.", "Continuous glucose monitoring and structured education can reduce severe events when accessible and appropriate."], "advancesSharedSavings": true, "category": "Endocrinology and Metabolism", "goodToKnow1": "Document sick day education and follow up plan to reduce repeat events.", "goodToKnow2": "Hypoglycemia prevention is as important as hyperglycemia management for utilization reduction.", "goodToKnow3": "Address psychosocial and access barriers that drive nonadherence." },

  { "code": "E10.11", "dx": "Type 1 diabetes mellitus with ketoacidosis with coma", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Coma indicates severe diabetic ketoacidosis requiring close monitoring for cerebral edema and organ dysfunction.", "Identify and correct the precipitating factor to prevent recurrence and rehospitalization.", "Post event follow up should include medication reconciliation, education, and safety planning."], "advancesSharedSavings": true, "category": "Endocrinology and Metabolism", "goodToKnow1": "Document neurologic findings and return to baseline function when known.", "goodToKnow2": "High risk patients often benefit from intensive case management and technology support.", "goodToKnow3": "Coordinate endocrinology follow up when available." },

  { "code": "E11.22", "dx": "Type 2 diabetes mellitus with diabetic chronic kidney disease", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Diabetes plus chronic kidney disease requires monitoring of kidney function and urine albumin to guide therapy and dosing.", "Blood pressure control and kidney protective glucose lowering therapy reduce progression to kidney failure.", "Avoid nephrotoxic medications and adjust doses of renally cleared drugs to prevent adverse events."], "advancesSharedSavings": true, "category": "Endocrinology and Nephrology", "goodToKnow1": "Also code the chronic kidney disease stage when documented to reflect severity.", "goodToKnow2": "Preventing progression to dialysis is a major shared savings lever.", "goodToKnow3": "Monitor potassium and kidney function after renin angiotensin system inhibitor changes." },

  { "code": "E11.29", "dx": "Type 2 diabetes mellitus with other diabetic kidney complication", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Specify the kidney manifestation when known to guide monitoring and treatment.", "Manage blood pressure, glucose, and albuminuria when appropriate to reduce progression.", "Medication dosing must reflect kidney function to avoid drug toxicity."], "advancesSharedSavings": true, "category": "Endocrinology and Nephrology", "goodToKnow1": "Also code the chronic kidney disease stage when applicable.", "goodToKnow2": "Early nephrology involvement for advanced stages reduces avoidable complications.", "goodToKnow3": "Clarify whether albuminuria is present because it changes risk." },

  { "code": "E11.40", "dx": "Type 2 diabetes mellitus with diabetic neuropathy, unspecified", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Diabetic neuropathy increases fall and ulcer risk and warrants foot examinations and protective footwear counseling.", "Optimize glycemic control and manage neuropathic pain with low harm regimens when possible.", "Educate on daily foot checks to prevent ulcers and amputations."], "advancesSharedSavings": true, "category": "Endocrinology", "goodToKnow1": "Document neuropathy findings and foot assessment results.", "goodToKnow2": "Preventing diabetic foot ulcers reduces admissions and procedural costs.", "goodToKnow3": "Coordinate podiatry when high risk features are present." },

  { "code": "E11.42", "dx": "Type 2 diabetes mellitus with diabetic polyneuropathy", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Polyneuropathy indicates diffuse nerve involvement and can impair gait, balance, and sensation.", "Fall prevention, foot care, and medication review are essential to reduce injury and ulcer risk.", "Assess for orthostatic symptoms and autonomic complications when relevant."], "advancesSharedSavings": true, "category": "Endocrinology", "goodToKnow1": "Functional assessment and gait stability documentation improves care planning.", "goodToKnow2": "Shared savings often comes from preventing ulcers, falls, and emergency pain visits.", "goodToKnow3": "Assess for depression and sleep disturbance that worsen symptom perception." },

  { "code": "E11.51", "dx": "Type 2 diabetes mellitus with diabetic peripheral angiopathy without gangrene", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Peripheral arterial disease in diabetes increases ulcer and amputation risk and requires vascular risk reduction.", "Prompt evaluation of nonhealing wounds reduces progression to infection and limb loss.", "Optimize blood pressure, lipid therapy, and glucose control to reduce cardiovascular and limb events."], "advancesSharedSavings": true, "category": "Endocrinology and Vascular Medicine", "goodToKnow1": "Document pulses, wound status, and referral plans when ulcers or ischemia are present.", "goodToKnow2": "Preventing progression to gangrene and amputation is a key shared savings target.", "goodToKnow3": "Encourage supervised exercise therapy when feasible." },

  { "code": "E11.52", "dx": "Type 2 diabetes mellitus with diabetic peripheral angiopathy with gangrene", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Gangrene in diabetes is a limb threatening condition requiring urgent vascular and infection evaluation.", "Early revascularization evaluation and infection management reduce amputation risk and length of stay.", "Pain control and wound care planning are essential to reduce repeated emergency presentations."], "advancesSharedSavings": true, "category": "Endocrinology and Vascular Medicine", "goodToKnow1": "Document the involved limb and whether infection or osteomyelitis is suspected.", "goodToKnow2": "This diagnosis is strongly associated with high cost episodes, making proactive management essential.", "goodToKnow3": "Coordinate multidisciplinary care including vascular surgery, podiatry, and wound care." },

  { "code": "E11.59", "dx": "Type 2 diabetes mellitus with other circulatory complications", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Circulatory complications increase risk of stroke, myocardial infarction, and limb events and require aggressive risk factor control.", "Use lipid lowering strategies and antiplatelet therapy when indicated based on clinical history and risk.", "Monitor for symptoms of ischemia and heart failure because diabetes increases cardiovascular event risk."], "advancesSharedSavings": true, "category": "Endocrinology and Cardiology", "goodToKnow1": "Specify the exact circulatory complication when documented to improve accuracy.", "goodToKnow2": "Shared savings gains often come from preventing cardiovascular admissions.", "goodToKnow3": "Coordinate medication adherence support." },

  { "code": "E11.65", "dx": "Type 2 diabetes mellitus with hyperglycemia", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Persistent hyperglycemia increases infection risk, impairs wound healing, and accelerates kidney and nerve injury.", "Adjust therapy based on hemoglobin A one c trends, home glucose data, and hypoglycemia risk.", "Lifestyle and medication optimization together reduce complications and prevent avoidable utilization."], "advancesSharedSavings": true, "category": "Endocrinology", "goodToKnow1": "Document hemoglobin A one c and a specific medication adjustment plan.", "goodToKnow2": "High utilization often comes from hyperglycemia related dehydration and infection.", "goodToKnow3": "Assess medication affordability and adherence barriers." },

  { "code": "E11.69", "dx": "Type 2 diabetes mellitus with other specified complication", "hccWeight": 0.166, "isHCC": true, "criticalFacts": ["Specify the linked complication in the note because this code implies a diabetes related manifestation.", "Complication focused monitoring reduces progression and acute events.", "Cardiovascular risk reduction and vaccination reduce downstream complications and hospitalizations."], "advancesSharedSavings": true, "category": "Endocrinology", "goodToKnow1": "Document the manifestation clearly such as neuropathy, chronic kidney disease, or ulcer when present.", "goodToKnow2": "Diabetes complication prevention is a high yield shared savings lever.", "goodToKnow3": "Avoid vague wording and ensure the complication is actively managed." },

  { "code": "R73.03", "dx": "Prediabetes", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Prediabetes indicates elevated risk of progression to type 2 diabetes and cardiovascular disease.", "Intensive lifestyle intervention focused on weight reduction and physical activity reduces progression risk.", "Monitor hemoglobin A one c periodically and address blood pressure and lipid risk factors early."], "advancesSharedSavings": true, "category": "Endocrinology and Preventive Care", "goodToKnow1": "Document the planned prevention strategy and follow up interval.", "goodToKnow2": "Prevention reduces future high cost diabetes complications.", "goodToKnow3": "Address sleep, nutrition, and medication contributors to weight gain when possible." },

  { "code": "Z79.4", "dx": "Long term (current) use of insulin", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Insulin use increases hypoglycemia risk and requires regular review of dosing and education.", "Confirm access to supplies, safe administration technique, and glucose monitoring plan.", "Review kidney function and nutrition patterns because these strongly affect insulin needs."], "advancesSharedSavings": true, "category": "Endocrinology", "goodToKnow1": "Medication reconciliation errors with insulin are a major preventable harm driver.", "goodToKnow2": "Hypoglycemia related emergency visits are a common shared savings opportunity.", "goodToKnow3": "Consider simplified regimens when safe to reduce errors." },

  { "code": "E66.01", "dx": "Morbid (severe) obesity due to excess calories", "hccWeight": 0.186, "isHCC": true, "criticalFacts": ["Morbid obesity increases risk of diabetes, hypertension, obstructive sleep apnea, osteoarthritis, and heart failure.", "Effective management includes structured nutrition and activity intervention, behavior support, and when appropriate medication or bariatric evaluation.", "Screen for obesity related complications such as obstructive sleep apnea and fatty liver disease to reduce downstream utilization."], "advancesSharedSavings": true, "category": "Endocrinology and Metabolism", "goodToKnow1": "Document body mass index and specific counseling or treatment actions taken at the visit.", "goodToKnow2": "Weight management programs can reduce admissions for diabetes and cardiovascular complications.", "goodToKnow3": "Address medications that promote weight gain when clinically appropriate." },

  { "code": "Z68.41", "dx": "Body mass index 40.0 to 44.9, adult", "hccWeight": 0.186, "isHCC": true, "criticalFacts": ["Body mass index coding supports severity documentation when paired with an obesity diagnosis and clinical management.", "Use measured height and weight at the encounter to avoid inaccurate classification.", "Link the body mass index to a management plan such as nutrition counseling, activity plan, or pharmacotherapy discussion."], "advancesSharedSavings": true, "category": "Endocrinology and Metabolism", "goodToKnow1": "Avoid using body mass index codes without documenting and addressing obesity clinically.", "goodToKnow2": "Improving weight measurement accuracy helps risk stratification and care planning.", "goodToKnow3": "Screen for obstructive sleep apnea and diabetes in patients with severe obesity." },

  { "code": "E66.9", "dx": "Obesity, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Use a more specific obesity diagnosis when available and document body mass index to improve clinical clarity.", "Obesity management improves blood pressure, glycemic control, and sleep apnea risk and reduces long term utilization.", "A structured plan with measurable follow up improves outcomes more than advice alone."], "advancesSharedSavings": true, "category": "Endocrinology and Metabolism", "goodToKnow1": "Consider specifying severity and cause when supported by the record.", "goodToKnow2": "Obesity is a key upstream driver of shared savings outcomes.", "goodToKnow3": "Document counseling, referral, or treatment escalation steps." },

  { "code": "E78.5", "dx": "Hyperlipidemia, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Hyperlipidemia management reduces cardiovascular events and avoids high cost hospitalizations.", "Use atherosclerotic cardiovascular disease risk and clinical history to guide statin intensity selection.", "Monitor lipid response and adherence and address statin intolerance with alternative strategies when necessary."], "advancesSharedSavings": true, "category": "Cardiology and Preventive Care", "goodToKnow1": "Use specific lipid disorders when known to improve precision.", "goodToKnow2": "Cardiovascular event prevention is a major shared savings focus.", "goodToKnow3": "Medication adherence is often the main limiting factor." },

  { "code": "E78.2", "dx": "Mixed hyperlipidemia", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Mixed hyperlipidemia often reflects combined elevated low density lipoprotein cholesterol and triglycerides and increases cardiovascular risk.", "Lifestyle intervention and statin therapy are core, with additional triglyceride management when clinically indicated.", "Evaluate secondary causes such as uncontrolled diabetes, hypothyroidism, alcohol use, and certain medications."], "advancesSharedSavings": true, "category": "Cardiology and Preventive Care", "goodToKnow1": "Document fasting lipid profile interpretation and treatment plan.", "goodToKnow2": "Addressing secondary causes can reduce medication burden and complications.", "goodToKnow3": "Coordinate with nutrition services for sustainable change." },

  { "code": "E03.9", "dx": "Hypothyroidism, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Monitor thyroid stimulating hormone and adjust replacement therapy to avoid over treatment or under treatment.", "Review adherence and timing of thyroid hormone ingestion because absorption is sensitive to food and other medications.", "Evaluate symptoms and cardiovascular effects, especially in older adults, because over replacement can increase arrhythmia and fracture risk."], "advancesSharedSavings": false, "category": "Endocrinology", "goodToKnow1": "Document most recent thyroid stimulating hormone result and dose adjustment plan.", "goodToKnow2": "Correct dosing reduces fatigue related visits and medication adverse events.", "goodToKnow3": "Check for medication interactions such as calcium or iron supplements that impair absorption." },

  { "code": "E55.9", "dx": "Vitamin D deficiency, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Vitamin D deficiency is associated with bone health concerns and may contribute to muscle weakness in susceptible patients.", "Repletion should be individualized based on measured level, dietary intake, sun exposure, and comorbid conditions.", "Avoid excessive supplementation to reduce risk of hypercalcemia and kidney stones."], "advancesSharedSavings": false, "category": "Endocrinology", "goodToKnow1": "Document the measured level and replacement plan.", "goodToKnow2": "In patients with osteoporosis, vitamin D sufficiency supports fracture prevention programs.", "goodToKnow3": "Assess dietary calcium and physical activity for bone health." },

  { "code": "E86.0", "dx": "Dehydration", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Dehydration is a common preventable driver of emergency visits in older adults and patients on diuretics or glucose lowering agents.", "Identify and address the cause such as infection, poor intake, vomiting, diarrhea, or medication effects.", "Follow up is important to prevent acute kidney injury, electrolyte abnormalities, and falls."], "advancesSharedSavings": true, "category": "Primary Care", "goodToKnow1": "Document orthostatic symptoms and medication contributors such as diuretics.", "goodToKnow2": "Hydration planning and early follow up reduce repeat emergency utilization.", "goodToKnow3": "Assess social factors that limit access to fluids or care." },

  { "code": "I10", "dx": "Essential (primary) hypertension", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Confirm hypertension using accurate measurement and repeated readings because misclassification drives overtreatment and undertreatment.", "Lifestyle intervention and medication therapy reduce stroke, myocardial infarction, and heart failure events.", "Monitor kidney function and electrolytes after medication changes to prevent adverse drug events."], "advancesSharedSavings": true, "category": "Cardiology and Preventive Care", "goodToKnow1": "Document home blood pressure values when available to support management decisions.", "goodToKnow2": "Blood pressure control is one of the highest value shared savings levers.", "goodToKnow3": "Assess adherence and simplify regimens when possible to improve control." },

  { "code": "I11.0", "dx": "Hypertensive heart disease with heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Document both hypertension and heart failure type because management depends on controlling afterload and volume status.", "Heart failure therapy includes multiple evidence based medication classes when tolerated to reduce mortality and hospitalization.", "Monitor kidney function and serum potassium closely when using renin angiotensin aldosterone system therapy."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Include left ventricular ejection fraction when known to clarify phenotype.", "goodToKnow2": "Avoidable utilization often relates to volume overload and medication nonadherence.", "goodToKnow3": "Daily weights and early symptom escalation plans reduce readmissions." },

  { "code": "I13.0", "dx": "Hypertensive heart and chronic kidney disease with heart failure and stage 1 through stage 4 chronic kidney disease, or unspecified chronic kidney disease", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["This diagnosis requires documentation of both heart failure and chronic kidney disease, and the kidney disease stage should be coded separately when known.", "Blood pressure control slows kidney disease progression and reduces heart failure exacerbations.", "Medication selection and dosing must account for kidney function to prevent hyperkalemia and kidney injury."], "advancesSharedSavings": true, "category": "Cardiology and Nephrology", "goodToKnow1": "Also code the chronic kidney disease stage code for clinical precision.", "goodToKnow2": "This combination is strongly associated with recurrent admissions and benefits from care management.", "goodToKnow3": "Monitor serum creatinine and potassium after medication changes." },

  { "code": "I13.2", "dx": "Hypertensive heart and chronic kidney disease with heart failure and stage 5 chronic kidney disease, or end stage renal disease", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Document heart failure type and kidney disease severity because advanced kidney disease changes diuretic response and medication tolerance.", "Coordinate nephrology and cardiology to manage volume, potassium, and blood pressure safely.", "Care transitions and dialysis planning are key to reducing preventable admissions."], "advancesSharedSavings": true, "category": "Cardiology and Nephrology", "goodToKnow1": "Also code stage 5 chronic kidney disease or end stage renal disease status when applicable.", "goodToKnow2": "High risk for hospitalization makes early follow up after acute episodes essential.", "goodToKnow3": "Medication reconciliation reduces duplicated diuretics and adverse events." },

  { "code": "I50.20", "dx": "Unspecified systolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Specify acuity and type when known because systolic heart failure management depends on evidence based therapy intensity.", "Recommended therapy for heart failure with reduced left ventricular ejection fraction typically includes four medication classes when tolerated: renin angiotensin system inhibitor therapy, evidence based beta blocker, mineralocorticoid receptor antagonist, and sodium glucose cotransporter two inhibitor.", "Daily weight monitoring and early response to fluid retention reduce emergency visits and admissions."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document left ventricular ejection fraction and New York Heart Association functional class when available.", "goodToKnow2": "Heart failure readmissions are a major shared savings focus.", "goodToKnow3": "Review kidney function and potassium after medication titration." },

  { "code": "I50.21", "dx": "Acute systolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Acute systolic heart failure indicates decompensation and requires evaluation for triggers such as infection, ischemia, arrhythmia, and medication nonadherence.", "Volume management with diuretics and optimization of evidence based heart failure therapy reduce length of stay and recurrence.", "Discharge planning with early outpatient follow up reduces readmission risk."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document suspected trigger and response to therapy adjustments.", "goodToKnow2": "Transitional care and medication reconciliation are high value interventions.", "goodToKnow3": "Provide a symptom escalation plan and target weight if applicable." },

  { "code": "I50.22", "dx": "Chronic systolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Chronic systolic heart failure care focuses on guideline based therapy optimization and self management education.", "Evidence based medication classes reduce mortality and hospitalization when tolerated and appropriately titrated.", "Monitor kidney function, serum potassium, and volume status to avoid decompensation."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document symptom stability and objective measures such as weight trends.", "goodToKnow2": "Avoidable utilization often results from volume overload and missed medications.", "goodToKnow3": "Encourage influenza and pneumococcal vaccination as part of preventive care planning." },

  { "code": "I50.23", "dx": "Acute on chronic systolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Acute on chronic status indicates a worsening episode on a background of chronic disease and should prompt trigger evaluation.", "Medication adjustments often require close monitoring for kidney injury and electrolyte abnormalities.", "Early post discharge follow up and education reduce recurrent decompensation."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document baseline versus current symptoms and weights to show severity.", "goodToKnow2": "This condition is strongly associated with repeat admissions, making follow up a shared savings priority.", "goodToKnow3": "Assess barriers to low sodium intake and medication adherence." },

  { "code": "I50.30", "dx": "Unspecified diastolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Diastolic heart failure management emphasizes blood pressure control, volume management, and treatment of comorbidities such as atrial fibrillation and obesity.", "Diuretics treat congestion, but over diuresis can worsen kidney function and cause falls.", "Clarifying left ventricular ejection fraction helps distinguish phenotypes and treatment options."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document volume status and comorbidity control plan such as blood pressure and arrhythmia management.", "goodToKnow2": "Preventing decompensation reduces admissions and observation stays.", "goodToKnow3": "Review medication list for agents that worsen fluid retention when possible." },

  { "code": "I50.31", "dx": "Acute diastolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Acute decompensation often relates to hypertension, atrial fibrillation with rapid rate, ischemia, or volume overload.", "Treat congestion, control blood pressure, and reassess precipitating factors to prevent recurrence.", "Discharge planning and early follow up reduce repeat emergency visits."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document the precipitating factor and response to treatment.", "goodToKnow2": "High value care includes transitional care and medication reconciliation.", "goodToKnow3": "Assess for sleep apnea and obesity as modifiable contributors." },

  { "code": "I50.32", "dx": "Chronic diastolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Chronic diastolic heart failure requires longitudinal management of blood pressure, volume status, and comorbidities.", "Atrial fibrillation control and obesity management can reduce symptoms and hospitalizations.", "Monitor kidney function when using diuretics and antihypertensives to avoid adverse effects."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document symptom stability and volume status at each visit.", "goodToKnow2": "Shared savings gains often come from preventing fluid overload admissions.", "goodToKnow3": "Encourage physical activity within safe limits and address frailty." },

  { "code": "I50.33", "dx": "Acute on chronic diastolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Acute on chronic diastolic heart failure indicates a decompensation episode requiring trigger identification and treatment.", "Care focuses on congestion control, blood pressure control, and management of comorbidities that worsen filling pressures.", "Follow up shortly after acute events reduces recurrent hospitalization."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document baseline and current symptom differences to support acuity.", "goodToKnow2": "This diagnosis often signals need for intensive care management.", "goodToKnow3": "Review dietary sodium intake and medication adherence barriers." },

  { "code": "I50.40", "dx": "Unspecified combined systolic and diastolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Combined heart failure reflects both systolic and diastolic dysfunction and usually requires comprehensive guideline based therapy.", "Monitor volume, kidney function, and potassium closely because combination dysfunction increases decompensation risk.", "Education on self monitoring and early symptom recognition lowers readmission risk."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Include left ventricular ejection fraction and current symptoms when available.", "goodToKnow2": "Avoidable admissions often relate to volume overload and medication gaps.", "goodToKnow3": "Encourage medication synchronization and simplified dosing when possible." },

  { "code": "I50.41", "dx": "Acute combined systolic and diastolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Acute combined heart failure is a high risk decompensation state requiring trigger evaluation and aggressive stabilization.", "Volume management should be balanced against kidney injury risk with close monitoring.", "Post discharge follow up and care transitions reduce recurrence."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document suspected trigger and response to treatment.", "goodToKnow2": "This condition has high readmission risk, making shared savings interventions high yield.", "goodToKnow3": "Ensure clear outpatient diuretic plan and monitoring instructions." },

  { "code": "I50.42", "dx": "Chronic combined systolic and diastolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Chronic combined dysfunction requires ongoing guideline based medication titration and monitoring.", "Assess functional status, volume status, and comorbidities such as atrial fibrillation and chronic kidney disease.", "Daily weights and adherence monitoring help prevent exacerbations."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document stability, exercise tolerance, and therapy adherence.", "goodToKnow2": "Care management and remote monitoring can reduce admissions in high risk patients.", "goodToKnow3": "Monitor kidney function after every major medication change." },

  { "code": "I50.43", "dx": "Acute on chronic combined systolic and diastolic (congestive) heart failure", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Acute on chronic combined heart failure indicates episodic worsening and should prompt evaluation for medication adherence and triggers.", "Therapy changes often require close monitoring of kidney function, electrolytes, and blood pressure.", "Coordinated transitional care reduces rehospitalization."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document baseline and current status to justify acuity and treatment intensity.", "goodToKnow2": "This is a high utilization diagnosis and a shared savings priority.", "goodToKnow3": "Ensure early outpatient follow up and a clear action plan for symptom worsening." },

  { "code": "I50.9", "dx": "Heart failure, unspecified", "hccWeight": 0.36, "isHCC": true, "criticalFacts": ["Use a more specific heart failure type when known such as systolic, diastolic, or combined, and specify acuity.", "Guideline based therapy and patient self management education reduce mortality and hospitalization.", "Daily weights, sodium reduction counseling, and medication reconciliation reduce decompensation."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document left ventricular ejection fraction when known to improve specificity.", "goodToKnow2": "Heart failure is highly associated with readmissions, making proactive outpatient management high value.", "goodToKnow3": "Monitor kidney function and potassium after therapy titration." },

  { "code": "I42.0", "dx": "Dilated cardiomyopathy", "hccWeight": 0.189, "isHCC": true, "criticalFacts": ["Dilated cardiomyopathy often leads to reduced ejection fraction and requires heart failure guideline based therapy when applicable.", "Evaluate potentially reversible causes such as ischemia, toxins, and tachycardia induced cardiomyopathy when clinically appropriate.", "Assess arrhythmia risk and need for device therapy in patients with persistent reduced ejection fraction."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document ejection fraction and symptom burden to guide therapy intensity.", "goodToKnow2": "Preventing decompensation and arrhythmia related admissions supports shared savings.", "goodToKnow3": "Coordinate cardiology follow up and imaging surveillance plan." },

  { "code": "I42.9", "dx": "Cardiomyopathy, unspecified", "hccWeight": 0.189, "isHCC": true, "criticalFacts": ["Specify cardiomyopathy type when known because etiology affects treatment and prognosis.", "Assess for heart failure symptoms, arrhythmias, and thromboembolic risk.", "Medication optimization and monitoring reduce admissions and adverse events."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Clarify ischemic versus nonischemic and document imaging findings when available.", "goodToKnow2": "High value care includes preventing heart failure and arrhythmia admissions.", "goodToKnow3": "Review alcohol and cardiotoxic medication exposures when relevant." },

  { "code": "I25.10", "dx": "Atherosclerotic heart disease of native coronary artery without angina pectoris", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Secondary prevention includes lipid lowering therapy, blood pressure control, smoking cessation, and diabetes control.", "Antiplatelet therapy may be indicated based on clinical history and bleeding risk.", "Cardiac symptom screening and functional status monitoring help prevent late presentations."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document history of myocardial infarction, stent, or bypass surgery when present because those specifics change management.", "goodToKnow2": "Preventing myocardial infarction and stroke is a major shared savings lever.", "goodToKnow3": "Ensure adherence support for statin and antihypertensive therapy." },

  { "code": "I25.118", "dx": "Atherosclerotic heart disease of native coronary artery with other forms of angina pectoris", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Angina symptoms require optimization of antianginal therapy and evaluation for ischemia when clinically indicated.", "Risk reduction with lipid lowering and blood pressure therapy reduces future events.", "Assess medication adherence and exertional symptom patterns to prevent emergency presentations."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document symptom frequency and functional limitation to guide therapy escalation.", "goodToKnow2": "Avoidable utilization often relates to uncontrolled symptoms and medication nonadherence.", "goodToKnow3": "Coordinate cardiology follow up when symptoms escalate." },

  { "code": "I20.0", "dx": "Unstable angina", "hccWeight": 0.24, "isHCC": true, "criticalFacts": ["Unstable angina indicates high risk coronary ischemia and requires urgent evaluation and management.", "Optimize antiplatelet, lipid lowering, and antianginal therapy based on clinical context and bleeding risk.", "Clear return precautions and rapid follow up reduce myocardial infarction risk."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document symptoms, electrocardiogram findings when available, and troponin interpretation if measured.", "goodToKnow2": "Prevention of progression to myocardial infarction is high value and shared savings aligned.", "goodToKnow3": "Address medication access barriers immediately." },

  { "code": "I21.4", "dx": "Non ST segment elevation (acute) myocardial infarction", "hccWeight": 0.252, "isHCC": true, "criticalFacts": ["Myocardial infarction requires aggressive secondary prevention including lipid lowering, blood pressure control, diabetes control, and smoking cessation.", "Cardiac rehabilitation and adherence support reduce recurrent events and readmissions.", "Monitor for heart failure, arrhythmias, and depression after myocardial infarction because these drive utilization."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document date of event and current status such as recent hospitalization or revascularization.", "goodToKnow2": "Avoidable costs often come from medication nonadherence and missed follow up.", "goodToKnow3": "Coordinate rehabilitation and close outpatient follow up." },

  { "code": "I21.A1", "dx": "Myocardial infarction type 2", "hccWeight": 0.252, "isHCC": true, "criticalFacts": ["Type two myocardial infarction is usually supply demand mismatch and requires treatment of the underlying trigger such as sepsis, anemia, tachyarrhythmia, or hypoxia.", "Secondary prevention strategies may still be appropriate depending on coronary disease burden and overall risk.", "Document the precipitating condition clearly because management differs from plaque rupture myocardial infarction."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Link the myocardial infarction to the underlying precipitating illness in documentation.", "goodToKnow2": "Preventing recurrence often depends on controlling the trigger condition.", "goodToKnow3": "Coordinate cardiology input for long term risk reduction." },

  { "code": "I21.A9", "dx": "Other type myocardial infarction", "hccWeight": 0.252, "isHCC": true, "criticalFacts": ["Clarify myocardial infarction mechanism and timing because acute active treatment differs from late effects.", "Secondary prevention and adherence support reduce recurrent events and hospitalization.", "Monitor for post infarction complications such as heart failure and arrhythmias."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document whether the event is current, recent, or historical.", "goodToKnow2": "Medication reconciliation and follow up are key shared savings interventions.", "goodToKnow3": "Coordinate cardiac rehabilitation when feasible." },

  { "code": "I48.0", "dx": "Paroxysmal atrial fibrillation", "hccWeight": 0.299, "isHCC": true, "criticalFacts": ["Stroke prevention requires structured thromboembolic risk assessment and shared decision making about anticoagulation.", "Rate control or rhythm control strategy should be individualized based on symptoms, heart failure status, and comorbidities.", "Evaluate reversible triggers such as thyroid disease, alcohol use, and obstructive sleep apnea."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document the anticoagulation decision and bleeding risk considerations.", "goodToKnow2": "Preventing stroke is a major shared savings and quality driver.", "goodToKnow3": "Confirm adherence and monitor renal function for anticoagulant dosing." },

  { "code": "I48.11", "dx": "Typical atrial flutter", "hccWeight": 0.299, "isHCC": true, "criticalFacts": ["Atrial flutter carries thromboembolic risk similar to atrial fibrillation and often requires anticoagulation based on stroke risk assessment.", "Rate control therapy and consideration of ablation can reduce symptoms and repeat admissions for rapid heart rate.", "Identify precipitating factors such as lung disease exacerbation, infection, or stimulant use."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document rhythm diagnosis and treatment strategy clearly.", "goodToKnow2": "Avoidable utilization often relates to uncontrolled rapid ventricular response and missed anticoagulation.", "goodToKnow3": "Coordinate cardiology follow up when recurrent." },

  { "code": "I48.20", "dx": "Chronic atrial fibrillation, unspecified", "hccWeight": 0.299, "isHCC": true, "criticalFacts": ["Chronic atrial fibrillation management focuses on stroke prevention and symptom control.", "Anticoagulation adherence and monitoring are central to preventing disabling stroke.", "Evaluate for heart failure, thyroid disease, and sleep apnea because they commonly coexist and worsen outcomes."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document current anticoagulant and adherence issues.", "goodToKnow2": "Stroke prevention and avoidance of bleeding events are key shared savings targets.", "goodToKnow3": "Monitor kidney function for anticoagulant dosing when indicated." },

  { "code": "I48.91", "dx": "Unspecified atrial fibrillation", "hccWeight": 0.299, "isHCC": true, "criticalFacts": ["Specify the atrial fibrillation pattern when known because it informs rhythm control decisions and monitoring.", "Stroke prevention and anticoagulation decision making remain central regardless of pattern.", "Rate control and symptom monitoring reduce emergency visits for palpitations and dyspnea."], "advancesSharedSavings": true, "category": "Cardiology", "goodToKnow1": "Document whether the rhythm is paroxysmal, persistent, or permanent if known.", "goodToKnow2": "Shared savings impact is driven by preventing stroke admissions and recurrent emergency visits.", "goodToKnow3": "Assess for triggers such as infection and dehydration." },

  { "code": "R00.0", "dx": "Tachycardia, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Unspecified tachycardia should prompt evaluation for underlying causes such as infection, dehydration, anemia, thyroid disease, medication effects, and arrhythmia.", "Document rhythm findings and symptoms because management differs for sinus tachycardia versus arrhythmia.", "Treating the underlying cause reduces repeat emergency visits."], "advancesSharedSavings": false, "category": "Primary Care and Cardiology", "goodToKnow1": "If atrial fibrillation or supraventricular tachycardia is confirmed, use the specific rhythm code.", "goodToKnow2": "Medication review and hydration counseling often reduce recurrence.", "goodToKnow3": "Consider ambulatory monitoring when symptoms persist." },

  { "code": "R60.0", "dx": "Localized edema", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Localized edema requires evaluation for venous disease, deep vein thrombosis, heart failure, kidney disease, liver disease, and medication effects.", "Treating the underlying cause reduces repeat visits and downstream complications such as ulcers.", "Document laterality, chronicity, and associated symptoms to guide workup."], "advancesSharedSavings": true, "category": "Primary Care", "goodToKnow1": "If edema is due to heart failure or venous ulcer disease, code the underlying condition for accuracy.", "goodToKnow2": "Preventing progression to skin breakdown is a shared savings opportunity.", "goodToKnow3": "Compression and mobility planning can reduce chronic edema complications when appropriate." },

  { "code": "I70.23", "dx": "Atherosclerosis of native arteries of extremities with ulceration, right leg", "hccWeight": 1.118, "isHCC": true, "criticalFacts": ["Peripheral arterial disease with ulceration is limb threatening and requires urgent wound and perfusion assessment.", "Aggressive cardiovascular risk reduction lowers limb and cardiac events.", "Early vascular evaluation for revascularization decreases amputation risk."], "advancesSharedSavings": true, "category": "Vascular Medicine and Wound Care", "goodToKnow1": "Document ulcer location, depth, and infection signs to guide urgency.", "goodToKnow2": "Avoiding amputation and prolonged wound care is highly shared savings relevant.", "goodToKnow3": "Coordinate wound care and vascular follow up." },

  { "code": "I70.24", "dx": "Atherosclerosis of native arteries of extremities with ulceration, left leg", "hccWeight": 1.118, "isHCC": true, "criticalFacts": ["Ulceration in peripheral arterial disease signals severe ischemia and high risk of infection and amputation.", "Timely perfusion assessment and wound care reduce emergency admissions and procedures.", "Risk factor management prevents myocardial infarction and stroke in this high risk group."], "advancesSharedSavings": true, "category": "Vascular Medicine and Wound Care", "goodToKnow1": "Document perfusion findings and referral plan.", "goodToKnow2": "Shared savings gains often come from preventing amputation and hospitalization.", "goodToKnow3": "Assess footwear and mobility to prevent additional injury." },

  { "code": "I70.25", "dx": "Atherosclerosis of native arteries of other extremities with ulceration", "hccWeight": 1.118, "isHCC": true, "criticalFacts": ["Ulceration indicates advanced peripheral arterial disease requiring coordinated vascular and wound management.", "Early evaluation for revascularization and infection control reduces amputation risk.", "Cardiovascular risk reduction prevents myocardial infarction and stroke in this high risk group."], "advancesSharedSavings": true, "category": "Vascular Medicine and Wound Care", "goodToKnow1": "Specify the extremity and ulcer site when possible to improve specificity.", "goodToKnow2": "Preventing major limb loss is strongly shared savings aligned.", "goodToKnow3": "Ensure smoking cessation support when applicable." },

  { "code": "I74.4", "dx": "Embolism and thrombosis of arteries of extremities, unspecified", "hccWeight": 0.455, "isHCC": true, "criticalFacts": ["Acute arterial thrombosis can be limb threatening and requires urgent evaluation for ischemia and underlying cause.", "Identify embolic sources such as atrial fibrillation or vascular disease to prevent recurrence.", "Anticoagulation and antiplatelet therapy decisions should reflect bleeding risk and etiology."], "advancesSharedSavings": true, "category": "Vascular Medicine", "goodToKnow1": "Document ischemic signs, timing, and treatment plan such as vascular intervention.", "goodToKnow2": "Preventing recurrence and amputations reduces high cost episodes.", "goodToKnow3": "Coordinate anticoagulation management and monitoring." },

  { "code": "J44.1", "dx": "Chronic obstructive pulmonary disease with (acute) exacerbation", "hccWeight": 0.319, "isHCC": true, "criticalFacts": ["Confirm chronic obstructive pulmonary disease diagnosis with spirometry when feasible and document exacerbation features and triggers.", "Exacerbation prevention includes smoking cessation, vaccination, inhaler technique review, and appropriate maintenance inhaler therapy.", "Assess for hypoxemia and need for oxygen evaluation in severe disease and arrange close follow up after an exacerbation."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document baseline symptoms and prior exacerbation history to guide therapy intensity.", "goodToKnow2": "Reducing exacerbations is a high yield shared savings target because exacerbations drive admissions.", "goodToKnow3": "Assess comorbid heart failure and pulmonary embolism when dyspnea pattern is atypical." },

  { "code": "J44.0", "dx": "Chronic obstructive pulmonary disease with (acute) lower respiratory infection", "hccWeight": 0.319, "isHCC": true, "criticalFacts": ["Document the infectious trigger and treat based on severity and likely pathogens while supporting antimicrobial stewardship.", "Review inhaler regimen and teach technique to reduce future exacerbations.", "Ensure post infection follow up to reassess oxygenation, symptoms, and maintenance therapy."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Vaccination status review is a simple high value intervention.", "goodToKnow2": "Preventing recurrent infections reduces hospitalizations and antibiotic exposure harm.", "goodToKnow3": "Consider pulmonary rehabilitation referral for persistent functional limitation." },

  { "code": "J44.9", "dx": "Chronic obstructive pulmonary disease, unspecified", "hccWeight": 0.319, "isHCC": true, "criticalFacts": ["Specify with exacerbation when present because exacerbation history changes risk and management needs.", "Smoking cessation remains the most effective intervention to slow lung function decline.", "Long acting inhaler therapy selection should be guided by symptoms and exacerbation history."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document spirometry results and symptom burden when available.", "goodToKnow2": "Preventing admissions often depends on inhaler access and adherence.", "goodToKnow3": "Screen for and manage comorbid anxiety and depression that worsen dyspnea perception." },

  { "code": "J43.9", "dx": "Emphysema, unspecified", "hccWeight": 0.319, "isHCC": true, "criticalFacts": ["Emphysema indicates chronic obstructive pulmonary disease phenotype and should prompt smoking cessation and vaccination planning.", "Monitor for hypoxemia, pulmonary hypertension, and weight loss in advanced disease.", "Pulmonary rehabilitation and optimized inhaler therapy reduce dyspnea and admissions."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document imaging findings and symptom severity for continuity.", "goodToKnow2": "Dyspnea crisis drives emergency visits and can be reduced with proactive planning.", "goodToKnow3": "Assess inhaler technique at every visit." },

  { "code": "J84.10", "dx": "Pulmonary fibrosis, unspecified", "hccWeight": 0.319, "isHCC": true, "criticalFacts": ["Pulmonary fibrosis causes progressive restrictive lung disease and requires evaluation for underlying cause and progression.", "Monitor oxygen needs, exercise tolerance, and vaccination status to reduce respiratory admissions.", "Early discussion of goals of care and symptom management planning is important in progressive disease."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document baseline oxygen requirement and functional capacity.", "goodToKnow2": "Avoidable admissions often result from hypoxemia and infection in advanced lung disease.", "goodToKnow3": "Coordinate pulmonology follow up and rehabilitation when feasible." },

  { "code": "J84.9", "dx": "Interstitial pulmonary disease, unspecified", "hccWeight": 0.319, "isHCC": true, "criticalFacts": ["Specify the interstitial lung disease subtype when known because treatment and prognosis differ widely.", "Monitor symptoms, oxygenation, and lung function to detect progression and treat complications early.", "Vaccination and infection prevention reduce avoidable exacerbations and admissions."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document diagnostic workup status and suspected cause.", "goodToKnow2": "Shared savings impact often comes from preventing respiratory failure admissions.", "goodToKnow3": "Assess medication toxicity when immunosuppressants are used." },

  { "code": "J45.909", "dx": "Asthma, unspecified, uncomplicated", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Confirm asthma diagnosis and assess control, triggers, and inhaler technique regularly.", "Controller therapy with inhaled corticosteroid containing regimens reduces severe exacerbations compared with short acting bronchodilator only use.", "Provide an asthma action plan and ensure access to rescue and controller medications."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Avoid unspecified asthma when severity and persistence can be documented.", "goodToKnow2": "Preventing exacerbations reduces emergency visits and oral steroid exposure.", "goodToKnow3": "Assess comorbid allergic rhinitis, gastroesophageal reflux disease, and obesity." },

  { "code": "J45.901", "dx": "Asthma with (acute) exacerbation, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["An asthma exacerbation should trigger review of controller use, inhaler technique, and trigger control.", "Short courses of systemic corticosteroid may be appropriate in moderate or severe exacerbations, with follow up to step up controller therapy.", "Ensure a written action plan and early follow up after an exacerbation to reduce recurrence."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document severity and response to treatment.", "goodToKnow2": "Avoidable utilization often comes from medication nonadherence and lack of action plans.", "goodToKnow3": "Assess access barriers to controller medications." },

  { "code": "J45.50", "dx": "Severe persistent asthma, uncomplicated", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Severe persistent asthma requires controller optimization, trigger control, and assessment for biologic therapy eligibility when appropriate.", "Frequent oral corticosteroid exposure drives complications such as osteoporosis, diabetes worsening, and infection.", "Specialist coordination and adherence monitoring reduce emergency visits."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document exacerbation frequency and current controller regimen.", "goodToKnow2": "Reducing steroid related complications supports shared savings.", "goodToKnow3": "Assess comorbid chronic rhinosinusitis and gastroesophageal reflux disease." },

  { "code": "J45.40", "dx": "Moderate persistent asthma, uncomplicated", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Moderate persistent asthma typically requires daily inhaled corticosteroid containing controller therapy.", "Assess control regularly and step therapy up or down based on symptoms and exacerbation history.", "Inhaler technique and adherence checks prevent avoidable exacerbations."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document control assessment results and trigger exposures.", "goodToKnow2": "Preventing exacerbations is the main shared savings lever in asthma.", "goodToKnow3": "Ensure vaccination and smoke exposure counseling." },

  { "code": "G47.33", "dx": "Obstructive sleep apnea (adult) (pediatric)", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Obstructive sleep apnea is associated with hypertension, arrhythmias, daytime sleepiness, and accident risk.", "Positive airway pressure therapy is effective when used consistently and adherence assessment is essential.", "Weight management and positional or oral appliance strategies may help selected patients."], "advancesSharedSavings": true, "category": "Pulmonology and Sleep Medicine", "goodToKnow1": "Document symptoms and whether the patient is using positive airway pressure therapy.", "goodToKnow2": "Improving adherence can reduce cardiovascular events and emergency visits.", "goodToKnow3": "Assess driving safety and daytime somnolence risk." },

  { "code": "J96.11", "dx": "Chronic respiratory failure with hypoxia", "hccWeight": 0.37, "isHCC": true, "criticalFacts": ["Chronic respiratory failure indicates advanced lung disease and requires monitoring of oxygenation and symptoms.", "Optimize underlying disease management to reduce exacerbations.", "Plan for equipment, vaccination, and early intervention for infections to avoid admissions."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document oxygen requirement and functional limitations.", "goodToKnow2": "Avoidable utilization often comes from missed oxygen access and delayed infection treatment.", "goodToKnow3": "Coordinate home services and pulmonary follow up." },

  { "code": "J96.12", "dx": "Chronic respiratory failure with hypercapnia", "hccWeight": 0.37, "isHCC": true, "criticalFacts": ["Hypercapnia suggests ventilatory failure and may require noninvasive ventilation evaluation in selected patients.", "Medication review is important because sedatives and opioids can worsen carbon dioxide retention.", "Close monitoring after exacerbations reduces repeat admissions."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document baseline carbon dioxide measures when available.", "goodToKnow2": "Preventing decompensation episodes reduces intensive care utilization.", "goodToKnow3": "Assess for obesity hypoventilation and sleep apnea as contributors." },

  { "code": "R09.2", "dx": "Respiratory arrest", "hccWeight": 0.37, "isHCC": true, "criticalFacts": ["Respiratory arrest is a critical event that requires documentation of cause and neurologic recovery status.", "Post event care often includes evaluation for underlying lung disease, medication effects, aspiration risk, and sleep disordered breathing.", "Care planning should address recurrence prevention and safety including supervision needs."], "advancesSharedSavings": true, "category": "Pulmonology and Critical Care", "goodToKnow1": "Document whether the event is current, recent, or a sequela to avoid inaccurate coding.", "goodToKnow2": "High risk of repeat emergency utilization makes care coordination essential.", "goodToKnow3": "Review oxygen and ventilation support plan." },

  { "code": "Z93.0", "dx": "Tracheostomy status", "hccWeight": 0.879, "isHCC": true, "criticalFacts": ["Tracheostomy status requires routine airway care planning, suction access, and supplies management.", "Assess for infection, obstruction, and skin breakdown risks because these commonly cause emergency visits.", "Swallow safety and aspiration prevention planning are often needed due to airway changes."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document tracheostomy type and routine care plan when available.", "goodToKnow2": "Proactive supply and caregiver support reduces acute airway presentations.", "goodToKnow3": "Coordinate home nursing and specialty follow up." },

  { "code": "Z43.0", "dx": "Encounter for attention to tracheostomy", "hccWeight": 0.879, "isHCC": true, "criticalFacts": ["This code is used for visits focused on tracheostomy care such as tube change, site care, or complication assessment.", "Document any complication such as infection or obstruction because it changes urgency and treatment.", "Education and supply checks reduce avoidable emergency visits."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document what was performed and whether complications were present.", "goodToKnow2": "High value care includes ensuring backup supplies and caregiver training.", "goodToKnow3": "Use additional codes for complications when documented." },

  { "code": "Z99.11", "dx": "Dependence on respirator (ventilator) status", "hccWeight": 0.879, "isHCC": true, "criticalFacts": ["Ventilator dependence requires coordinated respiratory therapy support and monitoring for infection and equipment failure.", "Assess secretion management plan and suction availability to prevent acute decompensation.", "Preventive care planning includes vaccination and early infection recognition to avoid hospitalization."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document ventilator settings summary and baseline oxygen needs when available.", "goodToKnow2": "Avoidable admissions often result from respiratory infection and equipment issues.", "goodToKnow3": "Coordinate durable medical equipment support and emergency backup plan." },

  { "code": "J69.0", "dx": "Pneumonitis due to inhalation of food and vomit", "hccWeight": 0.44, "isHCC": true, "criticalFacts": ["Aspiration pneumonitis indicates high risk swallowing dysfunction and should prompt swallow evaluation when appropriate.", "Address underlying contributors such as sedation, neurologic disease, gastroesophageal reflux, or poor dentition.", "Preventing recurrent aspiration reduces pneumonia admissions and antibiotic exposure."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document aspiration risk factors and prevention plan such as diet modification.", "goodToKnow2": "Recurrent aspiration is a common driver of avoidable hospitalizations.", "goodToKnow3": "Coordinate speech language pathology and caregiver education when needed." },

  { "code": "J13", "dx": "Pneumonia due to Streptococcus pneumoniae", "hccWeight": 0.204, "isHCC": true, "criticalFacts": ["Document severity and risk factors because these drive treatment setting.", "Vaccination against pneumococcus reduces future episodes and is a high value preventive intervention.", "After recovery, reassess aspiration risk factors to prevent recurrence."], "advancesSharedSavings": true, "category": "Pulmonology and Infectious Disease", "goodToKnow1": "Document pneumococcal vaccination status and plan.", "goodToKnow2": "Preventing repeat pneumonia admissions is shared savings aligned.", "goodToKnow3": "Consider follow up imaging based on clinical context and risk factors." },

  { "code": "J85.1", "dx": "Abscess of lung with pneumonia", "hccWeight": 0.204, "isHCC": true, "criticalFacts": ["Lung abscess often requires prolonged therapy and evaluation for aspiration contributors.", "Monitor clinical response and complications such as empyema or respiratory failure.", "Address risk factors such as poor oral hygiene and sedation to prevent recurrence."], "advancesSharedSavings": true, "category": "Pulmonology", "goodToKnow1": "Document imaging confirmation and planned duration of therapy.", "goodToKnow2": "Avoidable utilization often comes from incomplete therapy and missed follow up.", "goodToKnow3": "Coordinate pulmonary and infectious disease care when complex." },

  { "code": "N18.31", "dx": "Chronic kidney disease, stage 3a", "hccWeight": 0.127, "isHCC": true, "criticalFacts": ["Stage 3a chronic kidney disease requires classification by cause and albuminuria to guide risk and therapy.", "Blood pressure and diabetes control slow progression and reduce cardiovascular risk.", "Avoid nephrotoxic medications and adjust doses of renally cleared drugs."], "advancesSharedSavings": true, "category": "Nephrology", "goodToKnow1": "Document estimated glomerular filtration rate trend and urine albumin results when available.", "goodToKnow2": "Preventing progression reduces downstream dialysis and hospitalization costs.", "goodToKnow3": "Review nonsteroidal anti inflammatory drug use and contrast exposure risk." },

  { "code": "N18.32", "dx": "Chronic kidney disease, stage 3b", "hccWeight": 0.127, "isHCC": true, "criticalFacts": ["Stage 3b chronic kidney disease carries higher risk than stage 3a and warrants closer monitoring.", "Manage albuminuria, blood pressure, and diabetes to slow progression and reduce cardiovascular events.", "Review medication dosing and avoid nephrotoxins to prevent acute kidney injury."], "advancesSharedSavings": true, "category": "Nephrology", "goodToKnow1": "Document complication screening such as anemia and bone mineral disorder evaluation when relevant.", "goodToKnow2": "Shared savings impact often comes from preventing acute kidney injury admissions.", "goodToKnow3": "Consider nephrology referral if progression is rapid." },

  { "code": "N18.4", "dx": "Chronic kidney disease, stage 4 (severe)", "hccWeight": 0.514, "isHCC": true, "criticalFacts": ["Stage 4 chronic kidney disease requires planning for kidney replacement therapy options and close monitoring of complications.", "Medication dosing must be adjusted and high risk medicines should be avoided to prevent toxicity.", "Cardiovascular risk is high and aggressive risk factor control reduces events and hospitalizations."], "advancesSharedSavings": true, "category": "Nephrology", "goodToKnow1": "Document nephrology involvement and kidney replacement therapy education status.", "goodToKnow2": "Preventing emergency dialysis starts reduces cost and improves outcomes.", "goodToKnow3": "Monitor potassium and volume status closely." },

  { "code": "N18.5", "dx": "Chronic kidney disease, stage 5", "hccWeight": 0.815, "isHCC": true, "criticalFacts": ["Stage 5 chronic kidney disease indicates kidney failure risk and requires readiness for dialysis or transplant evaluation.", "Monitor for uremic symptoms, hyperkalemia, metabolic acidosis, and volume overload.", "Medication dosing and avoidance of nephrotoxins are critical to reduce adverse events."], "advancesSharedSavings": true, "category": "Nephrology", "goodToKnow1": "Document dialysis planning, access planning, and transplant referral status when applicable.", "goodToKnow2": "Emergency admissions often result from electrolyte abnormalities and fluid overload.", "goodToKnow3": "Coordinate multidisciplinary chronic kidney disease education." },

  { "code": "N18.6", "dx": "End stage renal disease", "hccWeight": 0.815, "isHCC": true, "criticalFacts": ["End stage renal disease usually implies dialysis dependence or transplant evaluation and requires coordination of access and dialysis adequacy.", "Monitor anemia management, bone mineral disorder, and volume status to reduce admissions.", "Medication reconciliation is critical because many drugs require dosing changes or avoidance."], "advancesSharedSavings": true, "category": "Nephrology", "goodToKnow1": "Document current dialysis modality and access type when applicable.", "goodToKnow2": "Access complications and missed dialysis are major drivers of avoidable emergency utilization.", "goodToKnow3": "Some programs apply a separate end stage renal disease risk model for beneficiaries with end stage renal disease." },

  { "code": "N17.9", "dx": "Acute kidney failure, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Acute kidney failure is often preventable and requires identifying causes such as dehydration, infection, obstruction, or medication toxicity.", "Medication dosing should be adjusted immediately to reduce adverse events.", "Follow up kidney function testing is essential to ensure recovery and prevent chronic progression."], "advancesSharedSavings": true, "category": "Nephrology and Primary Care", "goodToKnow1": "Document baseline kidney function and suspected cause.", "goodToKnow2": "Avoidable admissions often result from missed follow up and continued nephrotoxin exposure.", "goodToKnow3": "Evaluate for urinary obstruction when clinically indicated." },

  { "code": "Z99.2", "dx": "Dependence on renal dialysis", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Dialysis dependence requires coordination of access care, dialysis schedule adherence, and complication monitoring.", "Missed dialysis commonly causes volume overload and electrolyte emergencies leading to admission.", "Medication reconciliation and dietary counseling are essential parts of care."], "advancesSharedSavings": true, "category": "Nephrology", "goodToKnow1": "Document dialysis modality and access type when available.", "goodToKnow2": "Preventing missed treatments and access infections reduces high cost episodes.", "goodToKnow3": "Coordinate social support for transportation and scheduling barriers." },

  { "code": "Z94.0", "dx": "Kidney transplant status", "hccWeight": 1.068, "isHCC": true, "criticalFacts": ["Kidney transplant status requires lifelong immunosuppression management and monitoring for rejection and infection.", "Medication interactions and adherence failures are common drivers of graft loss and hospitalization.", "Routine monitoring of kidney function and immune suppressing drug levels reduces preventable complications."], "advancesSharedSavings": true, "category": "Nephrology and Transplant Medicine", "goodToKnow1": "Document immunosuppressive regimen and monitoring plan.", "goodToKnow2": "Avoidable utilization often results from infection and medication toxicity.", "goodToKnow3": "Coordinate care between transplant team and primary care." },

  { "code": "T86.10", "dx": "Kidney transplant rejection", "hccWeight": 1.068, "isHCC": true, "criticalFacts": ["Rejection is an urgent transplant complication requiring rapid transplant team coordination and treatment.", "Assess for infection and medication nonadherence because these often contribute to graft dysfunction.", "Close follow up and laboratory monitoring reduce progression to graft failure and dialysis."], "advancesSharedSavings": true, "category": "Transplant Medicine", "goodToKnow1": "Document biopsy status when applicable and current treatment plan.", "goodToKnow2": "Preventing graft loss is a major shared savings and quality driver.", "goodToKnow3": "Medication counseling is essential because immunosuppression changes are high risk." },

  { "code": "T86.12", "dx": "Kidney transplant failure", "hccWeight": 1.068, "isHCC": true, "criticalFacts": ["Transplant failure requires planning for dialysis or re transplant evaluation and careful management of immunosuppression risks.", "Monitor for volume overload, electrolyte disturbances, and anemia.", "Care transitions should include clear communication between transplant, nephrology, and primary care."], "advancesSharedSavings": true, "category": "Transplant Medicine and Nephrology", "goodToKnow1": "Document current kidney function and dialysis planning status.", "goodToKnow2": "Avoidable admissions are common during transition back to dialysis.", "goodToKnow3": "Coordinate vascular access planning early when needed." },

  { "code": "T86.13", "dx": "Kidney transplant infection", "hccWeight": 1.068, "isHCC": true, "criticalFacts": ["Transplant infection risk is increased due to immune suppression and requires rapid evaluation and targeted therapy.", "Medication interactions between antimicrobials and immunosuppressants must be managed carefully.", "Prevention includes vaccination, prophylaxis when indicated, and education on early symptom reporting."], "advancesSharedSavings": true, "category": "Transplant Medicine and Infectious Disease", "goodToKnow1": "Document infection site and organism when known.", "goodToKnow2": "Avoidable admissions often result from delayed evaluation in immunosuppressed patients.", "goodToKnow3": "Coordinate transplant team follow up promptly." },

  { "code": "N39.0", "dx": "Urinary tract infection, site not specified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Confirm infection with symptoms and appropriate testing to avoid overtreatment of asymptomatic bacteriuria when not indicated.", "Use culture guided antibiotics when risk factors for resistant organisms are present.", "Address recurrence drivers such as urinary retention, dehydration, and uncontrolled diabetes."], "advancesSharedSavings": true, "category": "Urology", "goodToKnow1": "Document symptoms and whether infection is complicated or recurrent.", "goodToKnow2": "Antibiotic stewardship reduces adverse drug events and resistant infections.", "goodToKnow3": "Consider evaluation for urinary obstruction when infections recur." },

  { "code": "R80.9", "dx": "Proteinuria, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Proteinuria is a risk marker for kidney disease progression and cardiovascular events and requires quantification when possible.", "Evaluate for diabetes, hypertension, and glomerular disease causes and manage blood pressure and albuminuria.", "Repeat testing and trend monitoring guide risk stratification and referral timing."], "advancesSharedSavings": true, "category": "Nephrology", "goodToKnow1": "Document urine albumin to creatinine ratio when available.", "goodToKnow2": "Reducing albuminuria slows kidney disease progression and reduces future cost.", "goodToKnow3": "Consider nephrology referral for heavy or persistent proteinuria." },

  { "code": "K21.9", "dx": "Gastroesophageal reflux disease without esophagitis", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Lifestyle interventions such as weight management and trigger food reduction can improve reflux symptoms.", "Proton pump inhibitor therapy should be used when indicated, with reassessment for step down when symptoms are controlled.", "Alarm symptoms such as dysphagia, weight loss, or gastrointestinal bleeding warrant prompt evaluation."], "advancesSharedSavings": false, "category": "Gastroenterology", "goodToKnow1": "Document duration of symptoms and response to therapy.", "goodToKnow2": "Avoid unnecessary long term therapy by reassessing indication periodically.", "goodToKnow3": "Consider evaluation for medication induced symptoms when relevant." },

  { "code": "K76.0", "dx": "Fatty (change of) liver, not elsewhere classified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Fatty liver disease is strongly linked to metabolic risk and requires management of weight, diabetes, and lipid disorders.", "Assess fibrosis risk using noninvasive tools when appropriate to identify patients needing specialist management.", "Alcohol intake assessment is essential because alcohol can contribute to steatotic liver disease."], "advancesSharedSavings": true, "category": "Hepatology", "goodToKnow1": "Document metabolic risk factors and a specific weight management or diabetes plan.", "goodToKnow2": "Reducing progression to cirrhosis is a shared savings lever.", "goodToKnow3": "Monitor liver enzymes and fibrosis risk over time." },

  { "code": "K72.10", "dx": "Chronic hepatic failure without coma", "hccWeight": 0.962, "isHCC": true, "criticalFacts": ["Chronic hepatic failure requires monitoring for decompensation such as ascites, variceal bleeding, encephalopathy, and infection.", "Medication safety is critical because liver dysfunction alters metabolism and increases adverse event risk.", "Nutrition assessment and vaccination planning reduce complications and admissions."], "advancesSharedSavings": true, "category": "Hepatology", "goodToKnow1": "Document complications and current management plan.", "goodToKnow2": "Avoidable admissions often result from fluid overload, bleeding, and infection.", "goodToKnow3": "Coordinate hepatology follow up and transplant evaluation when indicated." },

  { "code": "K70.30", "dx": "Alcoholic cirrhosis of liver without ascites", "hccWeight": 0.447, "isHCC": true, "criticalFacts": ["Alcohol related cirrhosis requires abstinence support and monitoring for decompensation even when ascites is not present.", "Screening and prevention planning for complications reduce emergency events.", "Medication review is important because sedatives and nonsteroidal anti inflammatory drugs can worsen outcomes."], "advancesSharedSavings": true, "category": "Hepatology", "goodToKnow1": "Document alcohol use status and treatment engagement for alcohol use disorder when applicable.", "goodToKnow2": "Preventing decompensation and bleeding events is shared savings aligned.", "goodToKnow3": "Coordinate hepatology care and vaccination planning." },

  { "code": "K74.60", "dx": "Unspecified cirrhosis of liver", "hccWeight": 0.447, "isHCC": true, "criticalFacts": ["Cirrhosis etiology should be clarified when possible because treatable causes change management.", "Assess for portal hypertension complications and infection risk to prevent admissions.", "Nutrition and medication safety planning reduce adverse events."], "advancesSharedSavings": true, "category": "Hepatology", "goodToKnow1": "Document etiology evaluation status.", "goodToKnow2": "Avoidable utilization often arises from encephalopathy, bleeding, and infections.", "goodToKnow3": "Coordinate specialty follow up and patient education." },

  { "code": "K74.69", "dx": "Other cirrhosis of liver", "hccWeight": 0.447, "isHCC": true, "criticalFacts": ["Clarify cause to guide treatment planning.", "Monitor for decompensation and complications and educate on early symptom recognition.", "Medication and nutrition planning reduce preventable harm."], "advancesSharedSavings": true, "category": "Hepatology", "goodToKnow1": "Document complications and current preventive measures.", "goodToKnow2": "Preventing first decompensation event greatly reduces costs.", "goodToKnow3": "Assess alcohol use and provide cessation support when relevant." },

  { "code": "B18.9", "dx": "Chronic viral hepatitis, unspecified", "hccWeight": 0.185, "isHCC": true, "criticalFacts": ["Clarify viral type because treatment differs for hepatitis B and hepatitis C.", "Assess liver fibrosis and monitor liver enzymes and viral markers to guide therapy timing.", "Vaccination and counseling on alcohol avoidance reduce progression risk."], "advancesSharedSavings": true, "category": "Hepatology", "goodToKnow1": "Document whether antiviral therapy is ongoing or planned.", "goodToKnow2": "Treating chronic viral hepatitis can prevent cirrhosis and cancer related costs.", "goodToKnow3": "Coordinate specialty care when indicated." },

  { "code": "K86.1", "dx": "Other chronic pancreatitis", "hccWeight": 0.357, "isHCC": true, "criticalFacts": ["Chronic pancreatitis can cause chronic pain, malabsorption, and diabetes and requires coordinated management.", "Alcohol and smoking cessation reduce exacerbations and progression.", "Monitor nutritional status and vitamin deficiency risk when malabsorption is suspected."], "advancesSharedSavings": true, "category": "Gastroenterology", "goodToKnow1": "Document pain control plan and enzyme replacement therapy use when applicable.", "goodToKnow2": "Avoidable utilization often relates to uncontrolled pain and acute flares.", "goodToKnow3": "Assess for pancreatic diabetes and coordinate endocrinology when present." },

  { "code": "K56.41", "dx": "Fecal impaction", "hccWeight": 0.326, "isHCC": true, "criticalFacts": ["Fecal impaction is common in frail patients and can cause urinary retention, delirium, and hospitalization.", "Identify drivers such as dehydration, immobility, and opioid therapy.", "A preventive bowel regimen and hydration plan reduces recurrence and emergency visits."], "advancesSharedSavings": true, "category": "Gastroenterology and Geriatrics", "goodToKnow1": "Document contributing medications and a prevention plan.", "goodToKnow2": "Preventing recurrence reduces emergency department utilization in older adults.", "goodToKnow3": "Assess for underlying neurologic disease and mobility limitations." },

  { "code": "K50.90", "dx": "Crohn disease, unspecified, without complications", "hccWeight": 0.55, "isHCC": true, "criticalFacts": ["Inflammatory bowel disease requires monitoring for flare symptoms, anemia, weight loss, and medication adverse effects.", "Maintenance therapy adherence reduces flares and hospitalization.", "Vaccination planning is important in immune suppressed patients."], "advancesSharedSavings": true, "category": "Gastroenterology", "goodToKnow1": "Document disease activity and current maintenance therapy.", "goodToKnow2": "Keeping patients in remission reduces admissions and steroid exposure.", "goodToKnow3": "Coordinate gastroenterology follow up and lab monitoring." },

  { "code": "K51.80", "dx": "Other ulcerative colitis without complications", "hccWeight": 0.244, "isHCC": true, "criticalFacts": ["Ulcerative colitis requires monitoring for flares, anemia, dehydration, and infection risk during immune suppression.", "Maintenance therapy adherence reduces flare driven hospitalizations.", "Assess for colorectal cancer surveillance needs in long standing disease."], "advancesSharedSavings": true, "category": "Gastroenterology", "goodToKnow1": "Document disease extent and current medication regimen.", "goodToKnow2": "Avoidable utilization often comes from flares and steroid complications.", "goodToKnow3": "Coordinate colon cancer surveillance planning when indicated." },

  { "code": "K59.00", "dx": "Constipation, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Constipation is a common driver of emergency visits when unmanaged, especially in older adults and opioid use.", "Identify secondary causes such as medications, dehydration, hypothyroidism, and low mobility.", "A consistent bowel regimen and dietary fiber plan reduce recurrence."], "advancesSharedSavings": true, "category": "Primary Care", "goodToKnow1": "Document medication contributors such as opioid therapy.", "goodToKnow2": "Preventing impaction reduces avoidable utilization.", "goodToKnow3": "Assess alarm symptoms such as bleeding or weight loss when present." },

  { "code": "K92.2", "dx": "Gastrointestinal hemorrhage, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Gastrointestinal bleeding requires evaluation for source and severity because management differs widely.", "Medication review for anticoagulants, antiplatelets, and nonsteroidal anti inflammatory drugs is essential to reduce recurrence.", "Follow up planning after stabilization reduces repeat bleeding admissions."], "advancesSharedSavings": true, "category": "Gastroenterology", "goodToKnow1": "Use a more specific bleeding source code when identified.", "goodToKnow2": "Preventing recurrence reduces high cost admissions.", "goodToKnow3": "Coordinate endoscopy follow up when needed." },

  { "code": "R19.7", "dx": "Diarrhea, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Persistent diarrhea can cause dehydration and acute kidney injury and should prompt evaluation for infection, medication effects, and inflammatory disease.", "Avoid unnecessary antibiotics and target testing based on risk factors.", "Hydration and electrolyte management reduce emergency visits."], "advancesSharedSavings": true, "category": "Primary Care", "goodToKnow1": "Document duration, frequency, and red flags such as blood or weight loss.", "goodToKnow2": "Preventing dehydration driven admissions is a shared savings opportunity.", "goodToKnow3": "Consider stool studies when clinically indicated." },

  { "code": "Z87.19", "dx": "Personal history of other diseases of the digestive system", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["History codes support context but should not be used when an active condition is present and being managed.", "Use history documentation to guide preventive surveillance when relevant.", "Ensure the active problem list distinguishes active disease versus resolved disease."], "advancesSharedSavings": false, "category": "Primary Care", "goodToKnow1": "Use active diagnosis codes when the condition is current.", "goodToKnow2": "Accurate problem list management reduces duplicated testing.", "goodToKnow3": "Document surveillance plan when history implies ongoing risk." },

  { "code": "G30.9", "dx": "Alzheimer disease, unspecified", "hccWeight": 0.341, "isHCC": true, "criticalFacts": ["Alzheimer disease requires assessment of cognition, function, and safety risks such as driving and medication management.", "Caregiver support and advance care planning reduce crisis driven emergency utilization.", "Review medications for anticholinergic burden and sedative effects that worsen cognition and falls."], "advancesSharedSavings": true, "category": "Neurology and Geriatrics", "goodToKnow1": "Document stage or severity and functional limitations when known.", "goodToKnow2": "Avoidable utilization often comes from falls, delirium, and caregiver burnout.", "goodToKnow3": "Coordinate community resources and social support services." },

  { "code": "F02.80", "dx": "Dementia in other diseases classified elsewhere without behavioral disturbance", "hccWeight": 0.341, "isHCC": true, "criticalFacts": ["Dementia requires evaluation of function, safety, and decision making capacity.", "Screen for reversible contributors such as medication effects, depression, and sensory impairment when appropriate.", "Caregiver education and structured routines reduce avoidable crises."], "advancesSharedSavings": true, "category": "Neurology and Geriatrics", "goodToKnow1": "Document underlying cause if known.", "goodToKnow2": "Care coordination reduces emergency utilization related to confusion and falls.", "goodToKnow3": "Assess home safety and wandering risk." },

  { "code": "F02.81", "dx": "Dementia in other diseases classified elsewhere with behavioral disturbance", "hccWeight": 0.341, "isHCC": true, "criticalFacts": ["Behavioral disturbance increases risk of hospitalization and caregiver burnout and warrants structured management planning.", "Medication use for agitation should be cautious due to fall risk and adverse effects.", "Assess for triggers such as pain, infection, constipation, and sleep disturbance that can worsen behavior."], "advancesSharedSavings": true, "category": "Neurology and Geriatrics", "goodToKnow1": "Document behaviors and specific management plan.", "goodToKnow2": "Preventing agitation related emergency visits is shared savings aligned.", "goodToKnow3": "Coordinate caregiver support and respite resources." },

  { "code": "G20", "dx": "Parkinson disease", "hccWeight": 0.615, "isHCC": true, "criticalFacts": ["Parkinson disease increases fall, aspiration, and functional decline risk and requires routine mobility and swallow assessment.", "Medication timing adherence is critical because missed doses commonly cause motor fluctuation and emergency visits.", "Screen for cognitive impairment, depression, and autonomic symptoms because they drive morbidity."], "advancesSharedSavings": true, "category": "Neurology", "goodToKnow1": "Document functional status, fall history, and therapy referrals.", "goodToKnow2": "Shared savings gains often come from fall prevention and avoiding aspiration pneumonia admissions.", "goodToKnow3": "Review medication schedule and caregiver support." },

  { "code": "G35", "dx": "Multiple sclerosis", "hccWeight": 0.647, "isHCC": true, "criticalFacts": ["Multiple sclerosis requires monitoring for relapse symptoms, mobility decline, and urinary complications.", "Disease modifying therapy adherence and infection monitoring reduce flares and admissions.", "Assess fall risk, spasticity, and depression because these strongly affect utilization."], "advancesSharedSavings": true, "category": "Neurology", "goodToKnow1": "Document current disease activity and treatment plan.", "goodToKnow2": "Preventing falls and urinary infections reduces emergency visits.", "goodToKnow3": "Coordinate rehabilitation services for mobility support." },

  { "code": "G12.21", "dx": "Amyotrophic lateral sclerosis", "hccWeight": 1.175, "isHCC": true, "criticalFacts": ["Amyotrophic lateral sclerosis is progressive and requires multidisciplinary care for respiratory, nutrition, and mobility support.", "Monitor swallowing and respiratory function to prevent aspiration and respiratory failure admissions.", "Early advance care planning and equipment planning reduces crisis driven utilization."], "advancesSharedSavings": true, "category": "Neurology", "goodToKnow1": "Document respiratory support status and nutrition support needs.", "goodToKnow2": "Avoidable utilization often comes from aspiration and respiratory complications.", "goodToKnow3": "Coordinate home services and caregiver training." },

  { "code": "G70.00", "dx": "Myasthenia gravis without (acute) exacerbation", "hccWeight": 0.516, "isHCC": true, "criticalFacts": ["Myasthenia gravis requires monitoring for bulbar symptoms and respiratory weakness because crisis can be life threatening.", "Medication review is essential because many drugs worsen neuromuscular transmission.", "Infection and stress can trigger worsening, so preventive care reduces admissions."], "advancesSharedSavings": true, "category": "Neurology", "goodToKnow1": "Document baseline strength and recent exacerbation history.", "goodToKnow2": "Preventing myasthenic crisis reduces intensive care utilization.", "goodToKnow3": "Coordinate neurology follow up and immunosuppression monitoring when used." },

  { "code": "G70.9", "dx": "Myoneural disorder, unspecified", "hccWeight": 0.516, "isHCC": true, "criticalFacts": ["Use a more specific neuromuscular diagnosis when known because treatment and crisis risk vary.", "Assess respiratory and swallow function when weakness is reported.", "Medication safety review reduces iatrogenic worsening."], "advancesSharedSavings": true, "category": "Neurology", "goodToKnow1": "Clarify whether this represents myasthenia gravis or another defined disorder.", "goodToKnow2": "Avoidable utilization often comes from medication triggered decompensation.", "goodToKnow3": "Neurology referral is often appropriate for diagnostic clarification." },

  { "code": "G71.00", "dx": "Muscular dystrophy", "hccWeight": 0.426, "isHCC": true, "criticalFacts": ["Muscular dystrophy often causes progressive weakness and may involve cardiac and respiratory complications requiring surveillance.", "Fall prevention, mobility support, and respiratory infection prevention reduce admissions.", "Care planning should address equipment needs and caregiver support."], "advancesSharedSavings": true, "category": "Neurology", "goodToKnow1": "Document functional status and assistive device use.", "goodToKnow2": "Preventing falls and respiratory infections is shared savings aligned.", "goodToKnow3": "Coordinate cardiology surveillance when indicated." },

  { "code": "G10", "dx": "Huntington disease", "hccWeight": 0.279, "isHCC": true, "criticalFacts": ["Huntington disease affects movement, cognition, and behavior and requires safety and caregiver support planning.", "Screen for depression and suicidality and address behavioral symptoms.", "Nutrition and swallow assessment reduce aspiration risk."], "advancesSharedSavings": true, "category": "Neurology and Behavioral Health", "goodToKnow1": "Document functional decline and support needs.", "goodToKnow2": "Avoidable utilization often comes from falls and behavioral crises.", "goodToKnow3": "Coordinate multidisciplinary care and advance care planning." },

  { "code": "G40.909", "dx": "Epilepsy, unspecified, not intractable, without status epilepticus", "hccWeight": 0.245, "isHCC": true, "criticalFacts": ["Seizure disorder management requires medication adherence and trigger identification.", "Assess safety counseling needs such as driving restrictions and fall risk.", "Review antiseizure medication interactions when clinically indicated."], "advancesSharedSavings": true, "category": "Neurology", "goodToKnow1": "Document seizure frequency and last seizure date.", "goodToKnow2": "Preventing breakthrough seizures reduces emergency utilization.", "goodToKnow3": "Medication reconciliation reduces dosing errors." },

  { "code": "G40.89", "dx": "Other seizures", "hccWeight": 0.245, "isHCC": true, "criticalFacts": ["Clarify seizure type when possible because diagnostic workup and therapy differ.", "Assess for reversible causes such as medication effects, substance withdrawal, infection, and metabolic abnormalities.", "Safety planning and adherence counseling reduce recurrent emergency episodes."], "advancesSharedSavings": true, "category": "Neurology", "goodToKnow1": "Document diagnostic workup status and treatment plan.", "goodToKnow2": "Avoidable utilization often results from missed antiseizure medications.", "goodToKnow3": "Coordinate neurology follow up for classification and long term management." },

  { "code": "R40.3", "dx": "Persistent vegetative state", "hccWeight": 0.543, "isHCC": true, "criticalFacts": ["Persistent vegetative state indicates severe neurologic injury and requires comprehensive care planning and goals of care discussions.", "Prevent complications such as pressure ulcers, aspiration, infections, and contractures.", "Caregiver support and home service coordination reduce avoidable admissions."], "advancesSharedSavings": true, "category": "Neurology and Complex Care", "goodToKnow1": "Document feeding method, respiratory support, and current complications.", "goodToKnow2": "Avoidable utilization often results from infections and pressure injuries.", "goodToKnow3": "Coordinate palliative care and caregiver resources." },

  { "code": "G93.1", "dx": "Anoxic brain damage, not elsewhere classified", "hccWeight": 0.543, "isHCC": true, "criticalFacts": ["Anoxic brain injury often causes long term cognitive and motor impairment and requires rehabilitation planning.", "Monitor for seizures and aspiration risk that can drive emergency utilization.", "Prevent secondary complications such as pressure ulcers and infections."], "advancesSharedSavings": true, "category": "Neurology and Rehabilitation", "goodToKnow1": "Document functional baseline and support needs.", "goodToKnow2": "Shared savings gains often come from preventing complications of immobility.", "goodToKnow3": "Coordinate home services and therapy referrals." },

  { "code": "I69.359", "dx": "Hemiplegia and hemiparesis following unspecified cerebrovascular disease affecting unspecified side", "hccWeight": 0.387, "isHCC": true, "criticalFacts": ["Stroke sequelae require ongoing secondary prevention and functional rehabilitation.", "Assess fall risk, swallow safety, and depression because these affect utilization and outcomes.", "Medication adherence for antithrombotic and blood pressure therapy prevents recurrent stroke."], "advancesSharedSavings": true, "category": "Neurology and Rehabilitation", "goodToKnow1": "Document functional level and therapy plan.", "goodToKnow2": "Preventing falls and recurrent stroke reduces high cost admissions.", "goodToKnow3": "Ensure home safety assessment when feasible." },

  { "code": "I69.349", "dx": "Monoplegia of lower limb following cerebral infarction affecting unspecified side", "hccWeight": 0.321, "isHCC": true, "criticalFacts": ["Monoplegia after stroke increases fall risk and requires mobility support and rehabilitation.", "Assess for spasticity, pain, and skin breakdown risk in the affected limb.", "Secondary prevention reduces recurrent cerebrovascular events."], "advancesSharedSavings": true, "category": "Neurology and Rehabilitation", "goodToKnow1": "Document gait status and assistive device needs.", "goodToKnow2": "Preventing falls and pressure injuries is shared savings aligned.", "goodToKnow3": "Coordinate therapy follow up and home modifications." },

  { "code": "I69.398", "dx": "Other sequelae of cerebral infarction", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Use the most specific stroke sequela code available such as dysphagia, aphasia, or cognitive deficit for clarity.", "Active secondary prevention and rehabilitation reduce long term disability and utilization.", "Assessment of function and social support needs reduces crisis driven emergency visits."], "advancesSharedSavings": true, "category": "Neurology and Rehabilitation", "goodToKnow1": "Specify the exact sequela in documentation to enable accurate coding.", "goodToKnow2": "Shared savings impact often comes from preventing falls and recurrent stroke.", "goodToKnow3": "Coordinate multidisciplinary rehabilitation care." },

  { "code": "R29.6", "dx": "Repeated falls", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Repeated falls require multifactorial assessment including gait, vision, medications, orthostatic hypotension, and home hazards.", "Address reversible causes and implement strength and balance interventions.", "Medication review to reduce sedatives and hypotensive burden is high value."], "advancesSharedSavings": true, "category": "Geriatrics", "goodToKnow1": "Document fall circumstances and injury history.", "goodToKnow2": "Fall prevention is a high yield shared savings intervention.", "goodToKnow3": "Consider physical therapy referral and home safety evaluation." },

  { "code": "G43.909", "dx": "Migraine, unspecified, not intractable, without status migrainosus", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Migraine care focuses on trigger identification, acute therapy optimization, and preventive therapy when attacks are frequent.", "Overuse of acute medications can cause rebound headaches and repeat visits.", "Assess for red flags that suggest secondary headache requiring urgent evaluation."], "advancesSharedSavings": false, "category": "Neurology", "goodToKnow1": "Document headache frequency and medication response.", "goodToKnow2": "Reducing emergency visits often requires a clear acute plan and preventive strategy.", "goodToKnow3": "Consider sleep, hydration, and stress contributors." },

  { "code": "T90.5", "dx": "Sequelae of intracranial injury", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Late effects of intracranial injury can include cognitive impairment, headaches, mood changes, and seizure risk.", "Rehabilitation and cognitive support planning reduce functional decline and utilization.", "Medication review and fall prevention are essential because dizziness and balance issues are common."], "advancesSharedSavings": true, "category": "Neurology and Rehabilitation", "goodToKnow1": "Document the functional deficits related to the prior injury.", "goodToKnow2": "Avoidable utilization often comes from falls and unmanaged neurobehavioral symptoms.", "goodToKnow3": "Coordinate neuropsychology and rehabilitation services when available." },

  { "code": "F20.9", "dx": "Schizophrenia, unspecified", "hccWeight": 0.511, "isHCC": true, "criticalFacts": ["Schizophrenia is associated with high medical comorbidity burden and requires coordinated behavioral and primary care.", "Antipsychotic therapy requires metabolic monitoring for weight gain, diabetes, and lipid changes.", "Medication adherence support and crisis planning reduce emergency utilization."], "advancesSharedSavings": true, "category": "Psychiatry and Behavioral Health", "goodToKnow1": "Document symptom stability and medication adherence.", "goodToKnow2": "Shared savings often comes from preventing crisis admissions and improving metabolic monitoring.", "goodToKnow3": "Coordinate community mental health resources and case management." },

  { "code": "F29", "dx": "Unspecified psychosis not due to a substance or known physiological condition", "hccWeight": 0.484, "isHCC": true, "criticalFacts": ["Psychosis requires assessment for safety and ability to care for self.", "Evaluate for reversible causes such as substance use, medication effects, infection, or metabolic disturbance when appropriate.", "Coordinated follow up and adherence support reduce recurrent emergency presentations."], "advancesSharedSavings": true, "category": "Psychiatry and Behavioral Health", "goodToKnow1": "Clarify diagnosis when possible because treatment differs by underlying disorder.", "goodToKnow2": "Crisis prevention planning is a key shared savings lever.", "goodToKnow3": "Coordinate behavioral health and primary care integration." },

  { "code": "F60.9", "dx": "Personality disorder, unspecified", "hccWeight": 0.396, "isHCC": true, "criticalFacts": ["Personality disorders often require psychotherapy focused treatment and coordinated care planning to reduce crisis utilization.", "Assess for comorbid depression, anxiety, and substance use because these increase risk.", "Consistent outpatient follow up reduces repeated emergency department presentations."], "advancesSharedSavings": true, "category": "Psychiatry and Behavioral Health", "goodToKnow1": "Document functional impact and comorbidity management.", "goodToKnow2": "Reducing crisis driven utilization supports shared savings.", "goodToKnow3": "Coordinate therapy resources and safety planning." },

  { "code": "F10.231", "dx": "Alcohol dependence with withdrawal delirium", "hccWeight": 0.424, "isHCC": true, "criticalFacts": ["Withdrawal delirium is life threatening and requires medically supervised management.", "Long term relapse prevention planning should include medication assisted treatment options and behavioral therapy resources when appropriate.", "Assess for liver disease and nutritional deficiency complications that drive utilization."], "advancesSharedSavings": true, "category": "Addiction Medicine", "goodToKnow1": "Document withdrawal severity history and current treatment plan.", "goodToKnow2": "Preventing repeat detox admissions is shared savings aligned.", "goodToKnow3": "Coordinate linkage to long term treatment and social support." },

  { "code": "F10.20", "dx": "Alcohol dependence, uncomplicated", "hccWeight": 0.242, "isHCC": true, "criticalFacts": ["Alcohol dependence increases risk of liver disease, falls, medication interactions, and depression.", "Offer evidence based treatment options and referral pathways for alcohol use disorder.", "Monitor for withdrawal risk and comorbid medical complications."], "advancesSharedSavings": true, "category": "Addiction Medicine", "goodToKnow1": "Document current use pattern, readiness to change, and treatment plan.", "goodToKnow2": "Reducing alcohol related admissions supports shared savings.", "goodToKnow3": "Coordinate behavioral health and primary care follow up." },

  { "code": "F10.21", "dx": "Alcohol dependence, in remission", "hccWeight": 0.242, "isHCC": true, "criticalFacts": ["Remission status should be supported by documentation of ongoing recovery plan and monitoring.", "Relapse prevention includes counseling, medication assisted options when indicated, and social support.", "Monitor comorbid depression and anxiety which increase relapse risk."], "advancesSharedSavings": true, "category": "Addiction Medicine", "goodToKnow1": "Document duration of remission and supports in place.", "goodToKnow2": "Relapse prevention reduces emergency utilization.", "goodToKnow3": "Coordinate liver disease surveillance when relevant." },

  { "code": "F11.20", "dx": "Opioid dependence, uncomplicated", "hccWeight": 0.424, "isHCC": true, "criticalFacts": ["Opioid dependence requires evidence based treatment such as buprenorphine, methadone, or naltrexone when indicated.", "Overdose prevention planning includes naloxone access and counseling.", "Coordinate behavioral health and social support to reduce relapse and emergency utilization."], "advancesSharedSavings": true, "category": "Addiction Medicine", "goodToKnow1": "Document current treatment status and overdose risk mitigation steps.", "goodToKnow2": "Medication assisted treatment reduces overdose and hospitalization risk.", "goodToKnow3": "Assess for infectious comorbidities and mental health conditions." },

  { "code": "F11.21", "dx": "Opioid dependence, in remission", "hccWeight": 0.424, "isHCC": true, "criticalFacts": ["Remission requires ongoing monitoring and relapse prevention planning.", "Continue evidence based recovery supports and reassess overdose risk periodically.", "Medication interactions and pain management strategies should be coordinated to avoid relapse triggers."], "advancesSharedSavings": true, "category": "Addiction Medicine", "goodToKnow1": "Document whether medication assisted treatment is ongoing.", "goodToKnow2": "Relapse prevention reduces emergency visits and admissions.", "goodToKnow3": "Coordinate chronic pain management to reduce high risk prescribing." },

  { "code": "F12.159", "dx": "Cannabis abuse with psychotic disorder, unspecified", "hccWeight": 0.424, "isHCC": true, "criticalFacts": ["Cannabis associated psychosis requires safety assessment and behavioral health follow up.", "Substance reduction counseling can reduce recurrence of psychosis and emergency utilization.", "Assess for coexisting mood and anxiety disorders that increase risk."], "advancesSharedSavings": true, "category": "Psychiatry and Behavioral Health", "goodToKnow1": "Document substance use pattern and symptom correlation.", "goodToKnow2": "Reducing substance triggered crisis visits supports shared savings.", "goodToKnow3": "Coordinate addiction and psychiatric care." },

  { "code": "F19.10", "dx": "Other psychoactive substance abuse, uncomplicated", "hccWeight": 0.423, "isHCC": true, "criticalFacts": ["Substance abuse increases risk of overdose, trauma, psychiatric crisis, and medical complications.", "Offer evidence based treatment referrals and harm reduction counseling.", "Screen for infectious and mental health comorbidities."], "advancesSharedSavings": true, "category": "Addiction Medicine", "goodToKnow1": "Document specific substance when known to improve treatment planning.", "goodToKnow2": "Reducing overdose and trauma admissions supports shared savings.", "goodToKnow3": "Coordinate social work and community resources." },

  { "code": "F32.9", "dx": "Major depressive disorder, single episode, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Screening for depression in adults is recommended when systems are in place for accurate diagnosis, effective treatment, and follow up.", "Assess suicidality and safety risk when depression is identified.", "Medication adherence and psychotherapy access strongly influence outcomes and utilization."], "advancesSharedSavings": true, "category": "Psychiatry", "goodToKnow1": "Document symptom severity and treatment plan including follow up interval.", "goodToKnow2": "Depression commonly worsens chronic disease adherence and increases emergency utilization.", "goodToKnow3": "Coordinate integrated behavioral health when available." },

  { "code": "F33.1", "dx": "Major depressive disorder, recurrent, moderate", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Recurrent depression requires long term management plan and monitoring for relapse.", "Assess suicidality and functional impairment regularly.", "Coordinate psychotherapy and medication management to reduce symptom driven utilization."], "advancesSharedSavings": true, "category": "Psychiatry", "goodToKnow1": "Document response to treatment and adherence barriers.", "goodToKnow2": "Improved depression control supports shared savings by improving chronic disease outcomes.", "goodToKnow3": "Evaluate substance use comorbidity." },

  { "code": "F41.1", "dx": "Generalized anxiety disorder", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Anxiety contributes to frequent visits and somatic symptom burden when untreated.", "Evidence based treatment includes cognitive behavioral therapy and select medications, with careful avoidance of long term sedative reliance when possible.", "Assess for comorbid depression and substance use."], "advancesSharedSavings": false, "category": "Psychiatry", "goodToKnow1": "Document symptom severity and functional impact.", "goodToKnow2": "Addressing anxiety can reduce emergency utilization for chest pain and dyspnea complaints.", "goodToKnow3": "Coordinate behavioral health referral when available." },

  { "code": "F43.10", "dx": "Post traumatic stress disorder, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Post traumatic stress disorder is associated with sleep disturbance, substance use, and chronic disease interaction.", "Trauma focused psychotherapy is a core evidence based intervention when accessible.", "Assess suicidality and substance use and coordinate care to reduce crisis utilization."], "advancesSharedSavings": true, "category": "Psychiatry", "goodToKnow1": "Document symptom clusters and treatment plan.", "goodToKnow2": "Improved behavioral health supports chronic disease management and shared savings.", "goodToKnow3": "Coordinate community resources and crisis planning." },

  { "code": "Z91.81", "dx": "History of falling", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["A history of falls requires proactive fall risk mitigation because past falls predict future falls.", "Medication review, vision assessment, and strength and balance intervention reduce fall risk.", "Home safety modifications and assistive devices may be needed."], "advancesSharedSavings": true, "category": "Geriatrics", "goodToKnow1": "Document specific fall circumstances and any injuries.", "goodToKnow2": "Fall prevention is shared savings aligned due to high fracture and hospitalization costs.", "goodToKnow3": "Consider osteoporosis screening and fracture prevention planning when appropriate." },

  { "code": "L03.90", "dx": "Cellulitis, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Cellulitis requires assessment of severity, systemic symptoms, and risk factors for resistant organisms.", "Marking borders and ensuring follow up within an appropriate interval reduces progression and admission.", "Evaluate for diabetic foot involvement and venous insufficiency contributors when present."], "advancesSharedSavings": true, "category": "Dermatology", "goodToKnow1": "Document site, size, and systemic symptoms to guide treatment setting.", "goodToKnow2": "Early outpatient management can prevent admission in non severe cases.", "goodToKnow3": "Address recurrent cellulitis risk factors such as edema and tinea pedis." },

  { "code": "L89.92", "dx": "Pressure ulcer of unspecified site, stage 2", "hccWeight": 0.838, "isHCC": true, "criticalFacts": ["Stage 2 pressure injury indicates partial thickness skin loss and requires offloading and moisture management.", "Assess nutrition and mobility because these are key drivers of healing and recurrence.", "Prevent infection and progression through consistent wound care and repositioning plan."], "advancesSharedSavings": true, "category": "Wound Care", "goodToKnow1": "Document stage and site clearly because stage drives risk and treatment.", "goodToKnow2": "Preventing progression to deeper ulcers reduces admissions and procedural costs.", "goodToKnow3": "Coordinate home nursing and durable medical equipment when needed." },

  { "code": "L89.93", "dx": "Pressure ulcer of unspecified site, stage 3", "hccWeight": 1.075, "isHCC": true, "criticalFacts": ["Stage 3 pressure injury indicates full thickness skin loss and requires aggressive offloading and wound care.", "Assess for infection and osteomyelitis when healing is delayed.", "Nutrition optimization and mobility support reduce recurrence and complications."], "advancesSharedSavings": true, "category": "Wound Care", "goodToKnow1": "Specify anatomic site when possible to improve care coordination.", "goodToKnow2": "Avoidable utilization often results from infection and progression to stage 4.", "goodToKnow3": "Document turning schedule and support surface plan." },

  { "code": "L89.94", "dx": "Pressure ulcer of unspecified site, stage 4", "hccWeight": 1.965, "isHCC": true, "criticalFacts": ["Stage 4 pressure injury involves deep tissue and has high risk of infection and osteomyelitis.", "Multidisciplinary management including wound care, nutrition, and mobility support is required.", "Preventing sepsis and hospitalization depends on early identification of infection and consistent offloading."], "advancesSharedSavings": true, "category": "Wound Care", "goodToKnow1": "Document stage, site, undermining, and infection signs.", "goodToKnow2": "This diagnosis is strongly associated with high cost utilization and shared savings interventions.", "goodToKnow3": "Coordinate specialty wound care and home services." },

  { "code": "L89.95", "dx": "Pressure ulcer of unspecified site, unstageable", "hccWeight": 1.075, "isHCC": true, "criticalFacts": ["Unstageable pressure injury requires debridement evaluation and careful monitoring for infection.", "Offloading and moisture management are essential to prevent progression.", "Nutrition and mobility support improve healing likelihood."], "advancesSharedSavings": true, "category": "Wound Care", "goodToKnow1": "Document why staging is not possible and the plan for reassessment.", "goodToKnow2": "Preventing progression to deep infection reduces admissions.", "goodToKnow3": "Coordinate wound care referral when needed." },

  { "code": "L97.509", "dx": "Non pressure chronic ulcer of other part of unspecified lower leg with unspecified severity", "hccWeight": 0.646, "isHCC": true, "criticalFacts": ["Chronic lower extremity ulcers require evaluation for venous disease, arterial disease, diabetes, and infection.", "Compression therapy is central for venous ulcers when arterial perfusion is adequate.", "Preventing infection and progression reduces admission and procedure costs."], "advancesSharedSavings": true, "category": "Wound Care", "goodToKnow1": "Document ulcer depth or severity when available, because severity can change management.", "goodToKnow2": "Ulcer healing reduces emergency utilization and antibiotic exposure.", "goodToKnow3": "Coordinate vascular evaluation when perfusion is limited." },

  { "code": "I87.319", "dx": "Venous stasis ulcer of unspecified site", "hccWeight": 1.291, "isHCC": true, "criticalFacts": ["Venous stasis ulcers require compression, leg elevation, and skin care when arterial perfusion is adequate.", "Treat underlying venous insufficiency and edema to prevent recurrence.", "Monitor for cellulitis and infection which drive admissions."], "advancesSharedSavings": true, "category": "Vascular and Wound Care", "goodToKnow1": "Document ulcer site and duration and whether compression is in use.", "goodToKnow2": "Preventing infection and hospitalization is shared savings aligned.", "goodToKnow3": "Coordinate wound care referral for nonhealing ulcers." },

  { "code": "I83.009", "dx": "Varicose veins of unspecified lower extremity with ulcer of unspecified site", "hccWeight": 0.646, "isHCC": true, "criticalFacts": ["Varicose veins with ulceration indicate chronic venous disease requiring compression and ulcer care.", "Assess for arterial disease before compression when pulses are reduced.", "Preventing recurrent skin infection reduces emergency utilization."], "advancesSharedSavings": true, "category": "Vascular and Wound Care", "goodToKnow1": "Document laterality and ulcer site when possible.", "goodToKnow2": "Compression adherence is a key shared savings lever.", "goodToKnow3": "Coordinate venous evaluation and wound care." },

  { "code": "B35.1", "dx": "Tinea unguium", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Nail fungus management requires confirmation and consideration of oral therapy risk versus benefit.", "Oral antifungal therapy may require liver function monitoring depending on regimen and patient risk.", "Foot hygiene and shoe care reduce recurrence and secondary bacterial infection risk."], "advancesSharedSavings": false, "category": "Dermatology", "goodToKnow1": "Document whether topical therapy has failed or is not appropriate.", "goodToKnow2": "In diabetes, foot infection prevention is more important than cosmetic improvement.", "goodToKnow3": "Coordinate podiatry in high risk patients." },

  { "code": "L60.0", "dx": "Ingrowing nail", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Ingrown nail can lead to infection in susceptible patients and requires proper nail care and footwear counseling.", "Assess for cellulitis in patients with redness, drainage, or pain.", "In patients with diabetes or poor circulation, early podiatry involvement reduces complications."], "advancesSharedSavings": false, "category": "Dermatology and Podiatry", "goodToKnow1": "Document infection signs and treatment provided.", "goodToKnow2": "Preventing diabetic foot infection supports shared savings.", "goodToKnow3": "Provide return precautions for worsening redness or fever." },

  { "code": "M05.9", "dx": "Rheumatoid arthritis with rheumatoid factor, unspecified", "hccWeight": 0.617, "isHCC": true, "criticalFacts": ["Rheumatoid arthritis requires disease modifying antirheumatic therapy planning and toxicity monitoring.", "Assess functional status, pain control, and cardiovascular risk because systemic inflammation increases cardiovascular events.", "Vaccination planning is important when immunosuppressive therapy is used."], "advancesSharedSavings": true, "category": "Rheumatology", "goodToKnow1": "Document medication monitoring needs such as laboratory tests and infection risk counseling.", "goodToKnow2": "Preventing flares and steroid complications supports shared savings.", "goodToKnow3": "Coordinate rheumatology follow up and adherence support." },

  { "code": "M06.00", "dx": "Rheumatoid arthritis without rheumatoid factor, unspecified site", "hccWeight": 0.617, "isHCC": true, "criticalFacts": ["Rheumatoid arthritis without rheumatoid factor still requires disease modifying therapy and monitoring.", "Assess joint involvement, functional limitation, and pain control to guide therapy intensity.", "Cardiovascular risk reduction is important due to inflammatory burden."], "advancesSharedSavings": true, "category": "Rheumatology", "goodToKnow1": "Document affected joints and functional impact when available.", "goodToKnow2": "Shared savings gains often come from reducing flares and infection related admissions.", "goodToKnow3": "Coordinate vaccination planning when immunosuppression is used." },

  { "code": "M05.60", "dx": "Rheumatoid arthritis of unspecified site with involvement of other organs and systems", "hccWeight": 0.617, "isHCC": true, "criticalFacts": ["Systemic involvement indicates more severe disease with higher complication risk.", "Monitor for extra articular manifestations and medication toxicity.", "Coordinated care reduces hospitalizations from systemic complications."], "advancesSharedSavings": true, "category": "Rheumatology", "goodToKnow1": "Document the involved organ system when known.", "goodToKnow2": "Severe systemic disease increases utilization, making proactive management important.", "goodToKnow3": "Coordinate specialty care for organ specific complications." },

  { "code": "M06.9", "dx": "Rheumatoid arthritis, unspecified", "hccWeight": 0.617, "isHCC": true, "criticalFacts": ["Use a more specific rheumatoid arthritis diagnosis when possible and document active management.", "Disease modifying antirheumatic therapy monitoring reduces infection and organ toxicity.", "Assess functional status and pain control to prevent disability and avoidable utilization."], "advancesSharedSavings": true, "category": "Rheumatology", "goodToKnow1": "Document disease activity and current disease modifying antirheumatic therapy.", "goodToKnow2": "Shared savings gains come from reducing flare admissions and steroid complications.", "goodToKnow3": "Coordinate immunization planning and infection prevention counseling." },

  { "code": "M17.11", "dx": "Unilateral primary osteoarthritis, right knee", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Osteoarthritis management includes weight management, exercise therapy, and safe analgesic strategies.", "Avoid unnecessary imaging when symptoms are stable and typical.", "Physical therapy and strengthening reduce pain and improve function."], "advancesSharedSavings": true, "category": "Orthopedics", "goodToKnow1": "Document functional limitations and conservative therapy trial before procedural escalation.", "goodToKnow2": "Reducing opioid use and unnecessary procedures supports shared savings.", "goodToKnow3": "Consider fall risk in patients with gait instability." },

  { "code": "M81.0", "dx": "Age related osteoporosis without current pathological fracture", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Osteoporosis screening uses central dual energy X-ray absorptiometry when indicated.", "Fracture prevention includes fall risk mitigation and evidence based pharmacotherapy when appropriate.", "Assess secondary causes and medication contributors such as glucocorticoid exposure."], "advancesSharedSavings": true, "category": "Rheumatology and Geriatrics", "goodToKnow1": "Document dual energy X-ray absorptiometry result and fracture risk assessment when available.", "goodToKnow2": "Preventing hip fractures is a major shared savings goal.", "goodToKnow3": "Coordinate calcium and vitamin D intake assessment and exercise planning." },

  { "code": "M54.50", "dx": "Low back pain, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Low back pain generally requires conservative management unless red flags are present.", "Avoid early imaging when there are no red flag signs to reduce low value care.", "Exercise therapy and function focused rehabilitation reduce chronic disability."], "advancesSharedSavings": true, "category": "Primary Care and Orthopedics", "goodToKnow1": "Document red flag screen such as fever, neurologic deficits, or cancer history.", "goodToKnow2": "Reducing unnecessary imaging and opioid prescribing supports shared savings.", "goodToKnow3": "Provide a return plan for worsening neurologic symptoms." },

  { "code": "M54.51", "dx": "Vertebrogenic low back pain", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Vertebrogenic low back pain implies vertebral endplate related pain and requires careful clinical correlation.", "Conservative care remains first line unless clear interventional indications exist.", "Functional improvement goals and physical therapy referral reduce chronic disability."], "advancesSharedSavings": true, "category": "Primary Care and Orthopedics", "goodToKnow1": "Document diagnostic rationale and imaging findings when used.", "goodToKnow2": "Avoiding repeated low yield imaging supports shared savings.", "goodToKnow3": "Assess for depression and sleep disturbance that increase chronic pain burden." },

  { "code": "M54.59", "dx": "Other low back pain", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Use the most specific low back pain code supported by the record.", "Conservative therapy and activity continuation usually improve outcomes.", "Screen for serious causes when red flags are present."], "advancesSharedSavings": true, "category": "Primary Care and Orthopedics", "goodToKnow1": "Document functional impact and response to treatment.", "goodToKnow2": "Shared savings benefits include reducing repeat visits and unnecessary imaging.", "goodToKnow3": "Encourage safe activity and core strengthening plan." },

  { "code": "G54.6", "dx": "Phantom limb syndrome with pain", "hccWeight": 0.598, "isHCC": true, "criticalFacts": ["Phantom limb pain requires multimodal pain management and rehabilitation support.", "Assess prosthetic fit and residual limb skin integrity to prevent ulcers and infections.", "Medication review is essential to avoid sedative burden and falls."], "advancesSharedSavings": true, "category": "Rehabilitation Medicine", "goodToKnow1": "Document functional goals and therapy plan.", "goodToKnow2": "Avoidable utilization often comes from uncontrolled pain and skin breakdown.", "goodToKnow3": "Coordinate prosthetics and rehabilitation follow up." },

  { "code": "Z89.511", "dx": "Acquired absence of right leg below knee", "hccWeight": 0.598, "isHCC": true, "criticalFacts": ["Below knee amputation status requires prosthetic and skin care planning to prevent ulcers and infection.", "Assess mobility and fall risk and coordinate physical therapy for gait training.", "Cardiovascular risk reduction is essential because many amputations are due to vascular disease."], "advancesSharedSavings": true, "category": "Rehabilitation Medicine", "goodToKnow1": "Document prosthesis use and residual limb skin status.", "goodToKnow2": "Preventing stump ulcers and falls reduces admissions.", "goodToKnow3": "Coordinate vascular risk management and podiatry for the remaining limb." },

  { "code": "T31.11", "dx": "Burns involving 10 to 19 percent of body surface with 10 to 19 percent third degree burns", "hccWeight": 1.291, "isHCC": true, "criticalFacts": ["Severe burns require infection prevention, pain control, and nutritional support planning.", "Monitor for fluid and electrolyte imbalance and wound infection which drive admissions.", "Rehabilitation planning reduces long term disability and repeat utilization."], "advancesSharedSavings": true, "category": "Burn and Wound Care", "goodToKnow1": "Document burn depth and total body surface area accurately.", "goodToKnow2": "Preventing infection and readmission is a key shared savings target.", "goodToKnow3": "Coordinate specialty burn follow up and home wound care." },

  { "code": "M00.80", "dx": "Arthritis due to other bacteria, unspecified joint", "hccWeight": 0.479, "isHCC": true, "criticalFacts": ["Bacterial arthritis requires urgent evaluation and treatment because joint destruction can occur rapidly.", "Culture guided antimicrobial therapy and drainage planning improve outcomes.", "Monitor for sepsis and complications that drive hospitalization."], "advancesSharedSavings": true, "category": "Infectious Disease and Orthopedics", "goodToKnow1": "Document joint involved and organism when known.", "goodToKnow2": "Timely therapy reduces surgical interventions and length of stay.", "goodToKnow3": "Coordinate orthopedic follow up and physical therapy for recovery." },

  { "code": "M86.9", "dx": "Osteomyelitis, unspecified", "hccWeight": 0.479, "isHCC": true, "criticalFacts": ["Osteomyelitis often requires prolonged therapy and careful follow up to prevent relapse.", "Source control and culture guided therapy reduce failures and resistance.", "In diabetes, foot care and perfusion assessment are critical to prevent recurrence and amputation."], "advancesSharedSavings": true, "category": "Infectious Disease and Wound Care", "goodToKnow1": "Document site and chronicity when known.", "goodToKnow2": "Avoidable utilization often comes from incomplete therapy and missed follow up.", "goodToKnow3": "Coordinate infectious disease and wound care services." },

  { "code": "S34.129D", "dx": "Incomplete lesion of unspecified level of lumbar spinal cord, subsequent encounter", "hccWeight": 0.478, "isHCC": true, "criticalFacts": ["Spinal cord injury requires long term complication prevention including pressure injury prevention and bladder and bowel management.", "Assess mobility and fall risk and coordinate rehabilitation services.", "Prevent infections such as urinary tract infections which commonly drive admissions."], "advancesSharedSavings": true, "category": "Rehabilitation Medicine", "goodToKnow1": "Document neurogenic bladder status and catheter use when applicable.", "goodToKnow2": "Preventing pressure injuries and infections provides important shared savings benefits.", "goodToKnow3": "Coordinate durable medical equipment and caregiver support." },

  { "code": "H35.3290", "dx": "Exudative age related macular degeneration, unspecified eye, stage unspecified", "hccWeight": 0.596, "isHCC": true, "criticalFacts": ["Exudative macular degeneration threatens vision and requires ophthalmology management to prevent irreversible loss.", "Assess fall risk and driving safety because vision loss increases injury risk.", "Medication and appointment adherence to intravitreal therapy schedules affects outcomes."], "advancesSharedSavings": true, "category": "Ophthalmology", "goodToKnow1": "Document treatment status with ophthalmology.", "goodToKnow2": "Preventing falls related to vision loss supports shared savings.", "goodToKnow3": "Coordinate low vision resources when needed." },

  { "code": "H43.10", "dx": "Vitreous hemorrhage, unspecified eye", "hccWeight": 0.336, "isHCC": true, "criticalFacts": ["Vitreous hemorrhage requires evaluation for retinal tear, diabetic retinopathy, or vascular occlusion.", "Prompt ophthalmology assessment reduces risk of permanent vision loss.", "In diabetes, optimize glycemic and blood pressure control to reduce recurrence."], "advancesSharedSavings": true, "category": "Ophthalmology", "goodToKnow1": "Document underlying cause when identified.", "goodToKnow2": "Preventing vision loss reduces downstream injury and utilization.", "goodToKnow3": "Coordinate diabetes management if causative." },

  { "code": "H43.13", "dx": "Vitreous hemorrhage, bilateral", "hccWeight": 0.336, "isHCC": true, "criticalFacts": ["Bilateral vitreous hemorrhage increases disability risk and requires urgent ophthalmology care.", "Assess fall risk and need for assistance with activities of daily living.", "Treat underlying cause such as proliferative diabetic retinopathy to prevent recurrence."], "advancesSharedSavings": true, "category": "Ophthalmology", "goodToKnow1": "Document visual function impact and safety planning.", "goodToKnow2": "Preventing falls and injuries associated with vision loss supports shared savings.", "goodToKnow3": "Coordinate low vision supports." },

  { "code": "H25.11", "dx": "Age related nuclear cataract, right eye", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Cataracts can cause functional vision loss and increase fall risk.", "Ophthalmology evaluation and surgical planning should be based on functional impairment and patient goals.", "Assess driving safety and home safety when vision is reduced."], "advancesSharedSavings": false, "category": "Ophthalmology", "goodToKnow1": "Document functional limitation such as difficulty driving or reading.", "goodToKnow2": "Fall prevention may be needed while awaiting surgery.", "goodToKnow3": "Coordinate vision correction and follow up." },

  { "code": "H91.90", "dx": "Hearing loss, unspecified, unspecified ear", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Hearing loss is associated with social isolation and can worsen cognitive outcomes and safety.", "Audiology referral and hearing aid evaluation can improve function.", "Assess for reversible causes such as cerumen impaction when clinically appropriate."], "advancesSharedSavings": false, "category": "Otolaryngology", "goodToKnow1": "Document functional impact and referral plan.", "goodToKnow2": "Addressing sensory impairment can reduce falls and improve adherence.", "goodToKnow3": "Coordinate cognitive screening when concerns arise." },

  { "code": "Z00.00", "dx": "Encounter for general adult medical examination without abnormal findings", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Preventive visits are an opportunity to close care gaps including cancer screening and vaccination.", "Assess cardiovascular risk factors and update chronic disease monitoring plans.", "Review medications and fall risk and document advance care planning when appropriate."], "advancesSharedSavings": true, "category": "Primary Care", "goodToKnow1": "Shared savings programs often depend on preventive gap closure and chronic disease control.", "goodToKnow2": "Document completed screenings and ordered tests clearly.", "goodToKnow3": "Update problem list with active conditions addressed during the visit." },

  { "code": "Z12.11", "dx": "Encounter for screening for malignant neoplasm of colon", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Screening for colorectal cancer is recommended starting at age 45 for average risk adults and continuing through age 75, with selective screening for ages 76 through 85 based on overall health and prior screening history.", "Multiple screening options exist, including stool based tests and direct visualization tests, and positive non colonoscopy tests require follow up colonoscopy.", "Ensuring follow up of abnormal screening results is critical to achieve mortality benefit."], "advancesSharedSavings": true, "category": "Preventive Care", "goodToKnow1": "Document last screening test type and date to support appropriate interval selection.", "goodToKnow2": "Screening reduces late stage cancer treatment costs and improves outcomes.", "goodToKnow3": "Coordinate navigation support to improve completion rates." },

  { "code": "Z23", "dx": "Encounter for immunization", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Vaccination reduces preventable infections that commonly drive admissions in older adults and patients with chronic disease.", "Document the vaccine administered and any contraindications or adverse reactions.", "Use immunization visits to ensure broader preventive gap closure when possible."], "advancesSharedSavings": true, "category": "Preventive Care", "goodToKnow1": "Immunization adherence is commonly measured in quality programs.", "goodToKnow2": "Vaccination reduces pneumonia, influenza, and infection related emergency utilization.", "goodToKnow3": "Document shared decision making when vaccine declined." },

  { "code": "Z71.3", "dx": "Dietary counseling and surveillance", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Nutrition counseling supports weight management, diabetes control, hypertension control, and fatty liver disease improvement.", "Effective counseling includes specific goals and measurable follow up rather than generic advice.", "Referral to dietitian services can improve outcomes when available."], "advancesSharedSavings": true, "category": "Primary Care", "goodToKnow1": "Document the counseling topic and a specific goal such as sodium reduction or carbohydrate planning.", "goodToKnow2": "Lifestyle intervention is a core shared savings strategy for cardiometabolic disease.", "goodToKnow3": "Coordinate community programs for sustainable support." },

  { "code": "E43", "dx": "Unspecified severe protein calorie malnutrition", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Severe malnutrition increases infection risk, impairs wound healing, and increases hospitalization risk.", "Diagnosis requires objective support such as weight loss history, intake assessment, and physical examination findings.", "Nutrition intervention and monitoring improve outcomes and reduce utilization."], "advancesSharedSavings": true, "category": "Nutrition", "goodToKnow1": "Document objective criteria supporting malnutrition and the nutrition plan.", "goodToKnow2": "Improving nutrition status reduces pressure injury complications and readmissions.", "goodToKnow3": "Coordinate dietitian and social support for food access barriers." },

  { "code": "N40.0", "dx": "Enlarged prostate without lower urinary tract symptoms", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Benign prostate enlargement can progress to urinary retention and recurrent infections in some patients.", "Monitor for symptom development and medication effects when alpha blockers or other therapy is used.", "Assess for red flags such as hematuria or recurrent urinary tract infections that warrant further evaluation."], "advancesSharedSavings": false, "category": "Urology", "goodToKnow1": "Document symptom status clearly and avoid diagnosing obstruction without symptoms.", "goodToKnow2": "Preventing urinary retention emergencies can reduce avoidable utilization.", "goodToKnow3": "Review medication list for agents that worsen urinary retention." },

  { "code": "I87.2", "dx": "Venous insufficiency (chronic) (peripheral)", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["Chronic venous insufficiency causes edema and skin changes and can progress to venous ulcers.", "Compression therapy and leg elevation improve symptoms when arterial perfusion is adequate.", "Skin care and early treatment of dermatitis and infection prevent ulcer formation."], "advancesSharedSavings": true, "category": "Vascular Medicine", "goodToKnow1": "Document edema severity and whether compression therapy is tolerated.", "goodToKnow2": "Ulcer prevention reduces admissions and wound care costs.", "goodToKnow3": "Assess for deep vein thrombosis history and mobility limitations." },

  { "code": "R05.9", "dx": "Cough, unspecified", "hccWeight": 0.0, "isHCC": false, "criticalFacts": ["A cough diagnosis should be refined to acute, subacute, or chronic when possible because evaluation differs.", "Assess for serious causes such as pneumonia, heart failure, chronic obstructive pulmonary disease exacerbation, or medication side effects.", "Use targeted testing based on duration, red flags, and patient risk factors to reduce low value imaging."], "advancesSharedSavings": false, "category": "Primary Care", "goodToKnow1": "Document cough duration and associated symptoms such as fever or weight loss.", "goodToKnow2": "Avoid unnecessary antibiotics for viral illness to reduce adverse events.", "goodToKnow3": "Use the most specific cough code available when documented."
  }
]
